{
    "creditos": 4,
    "codigo": "GCH292",
    "ementa": "Construção dos sentidos históricos. Noções de Identidade e de Fronteira. Invenção das tradições. Processos de povoamento, despovoamento e colonização. Conflitos econômicos e políticos. Choques culturais no processo de colonização. Questão indígena, cabocla e afrodescendente.",
    "horas": 60,
    "nome": "HISTÓRIA DA FRONTEIRA SUL",
    "objetivo": "Compreender o processo de formação da região sul do Brasil por meio da análise de aspectos históricos do contexto de povoamento, despovoamento e colonização.",
    "referencias_basicas": [
        "BARTH, Frederik. Grupos étnicos e suas fronteiras. In: POUTIGNAT, Philippe; STREIFF- FENART, Jocelyne. Teorias da etnicidade. Seguido de grupos étnicos e suas fronteiras de Frederik Barth. São Paulo: Editora da UNESP, 1998. p 185-228.",
        "CUCHE, Denys. A noção de cultura das Ciências sociais. Bauru: EDUSC, 1999.",
        "HALL, Stuart. A identidade cultural na pós-modernidade. 1. ed. Rio de Janeiro: DP&A Editora, 1992.",
        "HOBSBAWM, Eric. A invenção das tradições. Rio de Janeiro: Paz e Terra, 1984.",
        "LE GOFF, Jacques. Memória e História. Campinas: Ed. Unicamp, 1994.",
        "PESAVENTO, Sandra Jatahy. Além das fronteiras. In: MARTINS, Maria Helena (Org.). Fronteiras culturais – Brasil, Uruguay, Argentina. São Paulo: Ateliê Editorial, 2002."
    ],
    "referencias_complementares": [
        "ALBUQUERQUE JÚNIOR, Durval Miniz. Preconceito contra a origem geográfica e de lugar – As fronteiras da discórdia. 1. ed. São Paulo: Cortez, 2007.",
        "AMADO, Janaína. A Revolta dos Mucker. São Leopoldo: Unisinos, 2002.",
        "AXT, Gunter. As guerras dos gaúchos: história dos conflitos do Rio Grande do Sul. Porto Alegre: Nova Prova, 2008.",
        "BOEIRA, Nelson; GOLIN, Tau (Coord.). História Geral do Rio Grande do Sul. Passo Fundo: Méritos, 2006. 6 v.",
        "CEOM. Para uma história do Oeste Catarinense. 10 anos de CEOM. Chapecó: UNOESC, 1995.",
        "GUAZZELLI, César; KUHN, Fábio; GRIJÓ, Luiz Alberto; NEUMANN, Eduardo (Org.). Capítulos de História do Rio Grande do Sul. Porto Alegre: UFRGS, 2004.",
        "GRIJÓ, Luiz Alberto; NEUMANN, Eduardo (Org.). O continente em armas: uma história da guerra no sul do Brasil. Rio de Janeiro: Apicuri, 2010.",
        "LEITE, Ilka Boaventura (Org.). Negros no Sul do Brasil: Invisibilidade e territorialidade. Florianópolis: Letras Contemporâneas, 1996.",
        "MACHADO, Paulo Pinheiro. Lideranças do Contestado: a formação e a atuação das chefias caboclas (1912-1916). Campinas: UNICAMP, 2004.",
        "MARTINS, José de Souza. Fronteira: a degradação do outro nos confins do humano. São Paulo: Contexto, 2009.",
        "NOVAES, Adauto (Org.). Tempo e História. São Paulo: Companhia das Letras, 1992.",
        "OLIVEIRA, Roberto Cardoso de. Identidade, etnia e estrutura social. São Paulo:"
    ]
}