{
    "creditos": 4,
    "codigo": "GCH293",
    "ementa": "A natureza e especificidade do discurso filosófico e sua relação com outros campos do conhecimento; principais correntes do pensamento filosófico; Fundamentos filosóficos da Modernidade. Tópicos de Ética e de Epistemologia.",
    "horas": 60,
    "nome": "INTRODUÇÃO À FILOSOFIA",
    "objetivo": "Refletir criticamente, através de pressupostos éticos e epistemológicos, acerca da modernidade.",
    "referencias_basicas": [
        "ABBA, Giuseppe. História crítica da filosofia moral. São Paulo: Raimundo Lulio, 2011.",
        "DUTRA, Luiz Henrique de Araújo. Introdução à teoria da ciência. Florianópolis: EdUFSC, 2003.",
        "FRANCO, Irley; MARCONDES, Danilo. A Filosofia: O que é? Para que serve? São Paulo: Jorge Zahar, 2011.",
        "GALVÃO, Pedro (Org.). Filosofia: Uma Introdução por Disciplinas. Lisboa: Edições 70, 2012. (Extra Coleção).",
        "HESSEN, J. Teoria do conhecimento. São Paulo: Martins Fontes, 2003.",
        "MARCONDES, Danilo. Textos básicos de ética. São Paulo: Zahar editores, 2009.",
        "VAZQUEZ, Adolfo Sanchez. Ética. São Paulo: Civilização brasileira, 2005."
    ],
    "referencias_complementares": [
        "CANCLINI, Nestor García. Culturas híbridas. São Paulo: USP, 2000.",
        "GRANGER, Giles-Gaston. A ciência e as ciências. São Paulo: Unesp, 1994.",
        "HOBSBAWM, Eric. Era dos extremos. O breve século XX: 1914-1991. São Paulo: Companhia das Letras, 1995.",
        "HORKHEIMER, MAX. Eclipse da razão. São Paulo: Centauro, 2002.",
        "JAMESON, Frederic. Pós-modernismo: a lógica cultural do capitalismo tardio. 2. ed. São Paulo: Autores Associados, 2007.",
        "NOBRE, M. (Org.). Curso Livre de Teoria Crítica. 1. ed. Campinas: Papirus, 2008.",
        "REALE, Giovanni; ANTISERI, Dario. História da filosofia. 7. ed. São Paulo: Paulus, 2002. 3 v.",
        "SARTRE, Jean-Paul. Marxismo e existencialismo. In: . Questão de método. São Paulo: Difusão Européia do Livro, 1972.",
        "SCHILLER, Friedrich. Sobre a educação estética. São Paulo: Herder, 1963.",
        "SILVA, Márcio Bolda. Rosto e alteridade: para um critério ético em perspectiva latino- americana. São Paulo: Paulus, 1995."
    ]
}