{
    "creditos": 4,
    "codigo": "GCH416",
    "ementa": "Histórico, evolução e tendências. Instrumentação computacional do ensino. Sistemas de tutoria. Sistemas de autoria. Ambientes de aprendizagem. Ensino a distância.",
    "horas": 60,
    "nome": "INFORMÁTICA NA EDUCAÇÃO",
    "objetivo": "Analisar, selecionar e sistematizar recursos de informática facilitadores e\/ou estimuladores do processo de construção do conhecimento, reconhecendo as tecnologias de informação e comunicação como desencadeadores de novas estratégias de aprendizagem.",
    "referencias_basicas": [
        "ALMEIDA, Maria; MORAN, José. Integração das tecnologias na educação: Salto para o futuro. Brasília: MEC, 2005.",
        "BELLONI, Maria Luiza. Educação à distância. Campinas: Autores Associados, 1999.",
        "OLIVEIRA, Ramon de. Informática Educativa: dos planos e discursos à sala de aula. 15. ed. Campinas: Papirus, 2009.",
        "TEDESCO, Juan Carlos (Org.). Educação e novas tecnologias: esperança ou incerteza? São Paulo: Cortez; Brasília: UNESCO, 2004."
    ],
    "referencias_complementares": [
        "ALMEIDA, Fernando José de. Educação e Informática: os Computadores na Escola. São Paulo: Cortez, 1995.",
        "ANTUNES, Celso. Novas maneiras de ensinar. Novas formas de aprender. Porto Alegre: Artmed, 2002.",
        "GASPARETTI, Marco. Computador na Educação. São Paulo: Esfera, 2001.",
        "MORAES, Raquel de Almeida. Informática na educação. Rio de Janeiro: DP&A, 2000.",
        "OLIVEIRA, Celina Couto de. Ambientes informatizados de aprendizagem: produção e avaliação de software educativo. Campinas: Papirus, 2001.",
        "RBIE – Revista Brasileira de Informática na Educação. ISSN 1414-5685. Disponível em: <www.sbc.org.br\/rbie>.",
        "RENOTE – Revista Novas Tecnologias na Educação. ISSN 1679-1916. Disponível em: <http:\/\/www.cinted.ufrgs.br\/renote\/>.",
        "REVISTA INFORMÁTICA E EDUCAÇÃO: teoria e prática. Disponível em: <http:\/\/revista.pgie.ufrgs.br\/>.",
        "TAROUCO, Liane. Tecnologia digital na educação. Porto Alegre: UFRGS, 2001.",
        "VALENTE, J. A.; FREIRE, F. M. P. Aprendendo para a vida: os computadores na sala de aula. São Paulo: Cortez, 2001.",
        "VALENTE, José Armando. Computadores e conhecimento: repensando a educação. 2. ed. Campinas-SP: UNICAMP\/NIED, 1998."
    ]
}