{
    "creditos": 4,
    "codigo": "GCS239",
    "ementa": "Origens históricas e teóricas da noção de cidadania. O processo moderno de constituição dos direitos civis, políticos, sociais e culturais. Políticas de reconhecimento e promoção da cidadania. Direitos e cidadania no Brasil.",
    "horas": 60,
    "nome": "DIREITOS E CIDADANIA",
    "objetivo": "Permitir ao estudante uma compreensão adequada acerca dos interesses de classe, das ideologias e das elaborações retórico-discursivas subjacentes à categoria cidadania, de modo possibilitar a mais ampla familiaridade com o instrumental teórico apto a explicar a estrutural ineficácia social dos direitos fundamentais e da igualdade pressuposta no conteúdo jurídico-político da cidadania na modernidade.",
    "referencias_basicas": [
        "BOBBIO, Norberto. A Era dos Direitos. Rio de Janeiro: Campus, 1992.",
        "CARVALHO, José Murilo. Cidadania no Brasil: o longo caminho. 3. ed. Rio de Janeiro: Civilização brasileira, 2002.",
        "MARX, Karl. Crítica da Filosofia do Direito de Hegel. São Paulo: Boitempo, 2005.",
        "SARLET, Ingo Wolfgang. A eficácia dos direitos fundamentais: uma teoria geral dos direitos fundamentais na perspectiva constitucional. Porto Alegre: Livraria do Advogado, 2011.",
        "TORRES, Ricardo Lobo (Org.). Teoria dos Direitos Fundamentais. 2. ed. Rio de Janeiro: Renovar, 2001."
    ],
    "referencias_complementares": [
        "BONAVIDES, Paulo. Ciência Política. São Paulo: Malheiros, 1995.",
        "BRASIL. Constituição (1988). Constituição da República Federativa do Brasil. Brasília, DF: Senado Federal: Centro Gráfico, 1988. 292 p.",
        "DAHL, Robert A. Sobre a democracia. Brasília: UnB, 2009.",
        "DALLARI, Dalmo de Abreu. Elementos de teoria geral do Estado. São Paulo: Saraiva, 1995.",
        "DAL RI JÚNIO, Arno; OLIVEIRA, Odete Maria. Cidadania e nacionalidade: efeitos e perspectivas nacionais, regionais e globais. Ijuí: Unijuí, 2003.",
        "FÜHRER, Maximilianus Cláudio Américo. Manual de Direito Público e Privado. 18. ed. São Paulo: Editora Revista dos Tribunais, 2011.",
        "HONNETH, Axel. Luta por reconhecimento: a gramática moral dos conflitos sociais. Trad. Luiz Repa. São Paulo: Ed. 34, 2003.",
        "IANNI, Octavio. A sociedade global. 13. ed. Rio de Janeiro: Civilização brasileira, 2008.",
        "LOSURDO, Domenico. Democracia e Bonapartismo. Editora UNESP, 2004.",
        "MORAES, Alexandre. Direito constitucional. São Paulo: Atlas, 2009.",
        "MORAIS, José Luis Bolzan de. Do direito social aos interesses transindividuais: o Estado e o direito na ordem contemporânea. Porto Alegre: Livraria do Advogado, 1996.",
        "NOBRE, Marcos. Curso livre de teoria crítica. Campinas-SP: Papirus, 2008.",
        "PINHO, Rodrigo César Rebello. Teoria Geral da Constituição e Direitos Fundamentais. São Paulo: Saraiva, 2006.",
        "SEN, Amartya. Desenvolvimento como liberdade. São Paulo: Companhia das Letras, 2000.",
        "TOURAINE, Alain. Igualdade e diversidade: o sujeito democrático. Tradução Modesto Florenzano. Bauru-SP: Edusc, 1998."
    ]
}