{
    "creditos": 4,
    "codigo": "GCS238",
    "ementa": "Modos de produção: organização social, Estado, mundo do trabalho, ciência e tecnologia. Elementos de economia ecológica e política. Estado atual do capitalismo. Modelos produtivos e sustentabilidade. Experiências produtivas alternativas.",
    "horas": 60,
    "nome": "MEIO AMBIENTE, ECONOMIA E SOCIEDADE",
    "objetivo": "Proporcionar aos acadêmicos a compreensão acerca dos principais conceitos que envolvem a Economia Política e a sustentabilidade do desenvolvimento das relações socioeconômicas e do meio ambiente.",
    "referencias_basicas": [
        "ALTIERI, Miguel. Agroecologia: a dinâmica produtiva da agricultura sustentável. Porto Alegre: UFRGS, 1998.",
        "ANDERSON, Perry. Passagens da Antiguidade ao Feudalismo. São Paulo: Brasiliense, 2004.",
        "BECKER, B.; MIRANDA, M. (Org.). A geografia política do desenvolvimento sustentável. Rio de Janeiro: UFRJ, 1997.",
        "FERREIRA, L. C.; VIOLA, E. (Org.). Incertezas de sustentabilidade na globalização. Campinas: UNICAMP, 1996.",
        "HARVEY, David. Espaços de Esperança. São Paulo: Loyola, 2004.",
        "HUNT, E. K. História do pensamento econômico: uma perspectiva crítica. 2. ed. Rio de Janeiro: Elsevier, 2005.",
        "MAY, Peter H.; LUSTOSA, Maria Cecília; VINHA, Valéria da (Org.). Economia do meio ambiente. Teoria e Prática. Rio de Janeiro: Campus, 2003.",
        "MONTIBELLER FILHO, Gilberto. O mito do desenvolvimento sustentável. 2. ed. Florianópolis: UFSC, 2004.",
        "SACHS, Ignacy. A Revolução Energética do Século XXI. Revista Estudos Avançados, USP, v. 21, n. 59, 2007.",
        "SANTOS, Milton. 1992: a redescoberta da natureza. São Paulo: FFLCH\/USP, 1992.",
        "VEIGA, José Eli. Desenvolvimento Sustentável: o desafio do século XXI. Rio de Janeiro: Garamond, 2006."
    ],
    "referencias_complementares": [
        "ALIER, Jean Martinez. Da economia ecológica ao ecologismo popular. Blumenau: Edifurb, 2008.",
        "CAVALCANTI, C. (Org.). Sociedade e natureza: estudos para uma sociedade sustentável. São Paulo: Cortez; Recife: Fundação Joaquim Nabuco, 1998.",
        "DOBB, Maurice Herbert. A evolução do capitalismo. São Paulo: Abril Cultural, 1983. 284 p.",
        "FOSTER, John Bellamy. A Ecologia de Marx, materialismo e natureza. Rio de Janeiro: Civilização Brasileira, 2005.",
        "FURTADO, Celso. A economia latino-americana. São Paulo: Companhia das Letras, 2007.",
        "GREMAUD, Amaury; VASCONCELLOS, Marco Antonio; JÚNIOR TONETO, Rudinei. Economia brasileira contemporânea. 4. ed. São Paulo: Atlas, 2002.",
        "HUBERMAN, L. História da riqueza do homem. 21. ed. Rio de Janeiro: LTC, 1986.",
        "IANNI, O. Estado e capitalismo. 2. ed. rev. e ampl. São Paulo: Brasiliense, 1989.",
        "LEFF, Enrique. Epistemologia ambiental. 2. ed. São Paulo: Cortez, 2002."
    ]
}