{
    "creditos": 4,
    "codigo": "GEN254",
    "ementa": "Definições básicas de Teoria dos Grafos: vizinhança, isomorfismo, subgrafo, clique e conjunto independente. Representação computacional de grafos. Modelagem de problemas com grafos. Grafos bipartidos e cortes. Caminhos, ciclos, diâmetro e cintura. Conexidade e alcançabilidade. Grafos biconexos e articulações. Grafos dirigidos e caminho mínimo. Busca. Árvores e árvores geradoras de custo mínimo. Grafos eulerianos e hamiltonianos. Estabilidade e emparelhamento. Fluxo. Coloração e Planaridade. Problemas da Cobertura e da Travessia.",
    "horas": 60,
    "nome": "GRAFOS",
    "objetivo": "Compreender os conceitos básicos em Teoria dos Grafos. Modelar problemas e situações diversas com grafos. Desenvolver a criatividade e as habilidades formais de demonstração através de exercícios sobre grafos e aplicações. Dominar os problemas e algoritmos em Teoria dos Grafos, seus fundamentos teóricos e sua importância para a Computação e outras disciplinas do Conhecimento.",
    "referencias_basicas": [
        "BOLLOBÁS, B. Modern Graph Theory. 1. ed. Springer, 1998.",
        "DIESTEL, R. Graph Teory. 4. ed. Springer, 2010.",
        "NETTO, P. O. B. Grafos: Teoria, Modelos e Algoritmos. 4. ed. São Paulo: Blucher, 2006.",
        "NICOLETTI, M. do C.; HRUSCHKA Jr., E. R. Fundamentos da Teoria dos Grafos para Computação. 1. ed. São Carlos-SP: Ufscar, 2006."
    ],
    "referencias_complementares": [
        "BONDY, J. A.; MURTY, U. S. R. Graph theory. 1. ed. Springer, 2008.",
        "FEOFILOFF, P.; KOHAYAKAWA, Y.; WAKABAYASHI, Y. Teoria dos Grafos: Uma Introdução Sucinta. 2011. Disponível apenas eletronicamente em:",
        "<http:\/\/www.ime.usp.br\/~pf\/teoriadosgrafos\/>.",
        "LOVÁSZ, L. Combinatorial Problems And Exercices. 2. ed. American Mathematical Society, 2007.",
        "WILSON, R. J. Introduction to Graph Theory. 5. ed. São Paulo: Prentice Hall, 2010."
    ]
}