{
    "creditos": 4,
    "codigo": "GEX003",
    "ementa": "Conceito e construção de algoritmos. Tipos básicos de dados. Comandos de atribuição, condicionais e de repetição. Registros\/estruturas. Vetores e Matrizes. Strings. Modularização. Operações básicas em arquivos. Recursão. Ponteiros.",
    "horas": 60,
    "nome": "ALGORITMOS E PROGRAMAÇÃO",
    "objetivo": "Desenvolver o raciocínio lógico para o desenvolvimento de algoritmos. Compreender como o computador executa programas. Desenvolver algoritmos utilizando os conceitos aprendidos. Implementar algoritmos clássicos, como algoritmo de Euclides, crivo de Eratóstenes e exponenciação binária.",
    "referencias_basicas": [
        "LOPES, A.; GARCIA, G. Introdução à Programação. Rio de Janeiro: Campus, 2002.",
        "VILARIM, G. Algoritmos: Programação para Iniciantes. Rio de Janeiro: Ciência Moderna, 2004.",
        "FORBELLONE, A.; EBERSPACHER, H. Lógica de Programação: A Construção de Algoritmos e Estruturas de Dados. Pearson, 2005. ISBN-10: 8576050242.",
        "MANZANO, J.; OLIVEIRA, J. Algoritmos: Lógica para Desenvolvimento de Programação de Computadores. 22. ed. São Paulo: Érica, 2009."
    ],
    "referencias_complementares": [
        "KERNIGHAN, B.; RITCHIE, D. C. A Linguagem de programação padrão ANSI. Editora Campus, 1990.",
        "SCHILDT, Herbert. C completo e total. São Paulo: Makron Books, 1997.",
        "LOPES, A.; GARCIA, G. Introdução à Programação: 500 algoritmos resolvidos. Rio de Janeiro: Campus, 2002.",
        "ARAÚJO, E. C. Algoritmos: Fundamentos e Prática. 2. ed. Florianópolis: Visual Books, 2005.",
        "BORATTI, I. C. Introdução à Programação: Algoritmos. 2. ed. Florianópolis: Visual Books, 2004"
    ]
}