{
    "creditos": 4,
    "codigo": "GEX101",
    "ementa": "Alfabeto, palavras, linguagens, autômatos, gramáticas e suas representações. A hierarquia de Chomsky. Linguagens regulares, autômatos finitos, gramáticas regulares e expressões regulares. Linguagens livres de contexto, gramáticas livres do contexto e autômatos de pilha. Linguagens sensíveis ao contexto e irrestritas. Gramáticas: ambiguidade e desambiguação.",
    "horas": 60,
    "nome": "LINGUAGENS FORMAIS E AUTÔMATOS",
    "objetivo": "Compreender os conceitos de alfabeto, palavra, linguagem, gramática e autômato e sua importância para a formalização da Computação. Classificar formalmente uma linguagem de acordo com a hierarquia de Chomsky. Dominar as expressões regulares e suas aplicações para reconhecimento de padrões. Familiarizar-se com gramáticas e sua desambiguação. Dominar os fundamentos teóricos da construção de compiladores.",
    "referencias_basicas": [
        "DAVIS, M. D.; WEYUKER, E. J. Computability, Complexity and Languages: Fundamentals of Theoretical Computer Science. 2. ed. Morgan Kaufmann, 1994.",
        "HOPCROFT, J. E.; MOTWANI, R.; ULLMAN, J. D. Introdução à Teoria dos Autômatos, Linguagens e Computação. 1. ed. Rio de Janeiro: Campus, 2002.",
        "MENEZES, P. B. Linguagens Formais e Autômatos. 5. ed. Porto Alegre: Bookman, 2008."
    ],
    "referencias_complementares": [
        "AHO, A. V.; LAM, M. S.; SETHI, R.; ULLMAN, J. D. Compiladores: Princípios, Técnicas e Ferramentas. 1. ed. São Paulo: Pearson\/Prentice Hall, 2007.",
        "DIVERIO, T. A.; MENEZES, P. B. Teoria da Computação: Máquinas Universais e Computabilidade. 3. ed. Porto Alegre: Bookman, 2011.",
        "SUDKAMP, T. A. Languages and Machines: An Introduction to the Theory of Computer Science. 3. ed. Addison Wesley, 2005."
    ]
}