{
    "creditos": 4,
    "codigo": "GEX213",
    "ementa": "Grandezas proporcionais. Noções de geometria. Conjuntos numéricos. Equações e inequações. Funções.",
    "horas": 60,
    "nome": "MATEMÁTICA C",
    "objetivo": "Utilizar conceitos e procedimentos matemáticos para analisar dados, elaborar modelos e resolver problemas. Sintetizar, deduzir, elaborar hipóteses, estabelecer relações e comparações, detectar contradições, decidir, organizar, expressar-se e argumentar com clareza e coerência utilizando elementos de linguagem matemática.",
    "referencias_basicas": [
        "CONNALLY, E. et al. Funções para modelar variações: uma preparação para o cálculo. Rio de Janeiro: LTC, 2009.",
        "DEMANA, D. F. et al. Pré-Cálculo. São Paulo: Addison Wesley, 2009.",
        "DOLCE, O.; POMPEO, J. N. Fundamentos de Matemática Elementar: Geometria Plana. 8. ed. São Paulo: Atual, 2005. 9 v.",
        "_______. Fundamentos de Matemática Elementar: Geometria Espacial. 6. ed. São Paulo: Atual, 2005. 10 v.",
        "DORING, C. I.; DORING, L. R. Pré-cálculo. Porto Alegre: UFRGS, 2007.",
        "IEZZI, G.; MURAKAMI, C. Fundamentos de matemática elementar: Conjuntos, Funções. 8. ed. São Paulo: Atual, 2010. 1 v.",
        "IEZZI, G.; DOLCE, O.; MURAKAMI, C. Fundamentos de matemática elementar: Logaritmos. 8. ed. São Paulo: Atual, 2004. 2 v.",
        "IEZZI, G. Fundamentos de matemática elementar: Trigonometria. 8. ed. São Paulo: Atual, 2004. 3 v.",
        "MEDEIROS, V. Z. et al. Pré-Cálculo. 2. ed. São Paulo: Cengage Learning, 2009."
    ],
    "referencias_complementares": [
        "ANTON, H. Cálculo. 8. ed. São Paulo: Bookman, 2007. 1 v.",
        "BARBOSA, J. L. M. Geometria Euclidiana Plana. Rio de janeiro: SBM, 2000. (Coleção do Professor de Matemática).",
        "FLEMMING, D. M.; GONÇALVES, M. B. Cálculo A. 6. ed. São Paulo: Prentice Hall, 2007.",
        "LEITHOLD, L. Cálculo com geometria analítica. 3. ed. São Paulo: HARBRA, 1994. 1 v.",
        "LIMA, E. L. et al. A Matemática do Ensino Médio. 6. ed. Rio de Janeiro: SBM, 2000. 2 v. (Coleção do Professor de Matemática).",
        "_______. A matemática do Ensino Médio. 4. ed. Rio de Janeiro: SBM, 1999. 1 v. (Coleção do Professor de Matemática).",
        "STEWART, J. Cálculo. 6. ed. São Paulo: Cengage Learning, 2010. 1 v."
    ]
}