{
    "creditos": 4,
    "codigo": "GEX208",
    "ementa": "Fundamentos de informática. Conhecimentos de sistemas operacionais. Utilização da rede mundial de computadores. Ambientes virtuais de aprendizagem. Conhecimentos de softwares de produtividade para criação de projetos educativos e\/ou técnicos e\/ou multimidiáticos.",
    "horas": 60,
    "nome": "INFORMÁTICA BÁSICA",
    "objetivo": "Operar as ferramentas básicas de informática de forma a poder utilizá-las interdisciplinarmente, de modo crítico, criativo e pró-ativo.",
    "referencias_basicas": [
        "ANTONIO, João. Informática para Concursos: teoria e questões. Rio de Janeiro: Campus-Elsevier, 2009.",
        "CAPRON, H. L.; JOHNSON, J. A. Introdução à Informática. 8. ed. São Paulo: Pearson Prentice Hall, 2004.",
        "NORTON, P. Introdução à informática. São Paulo: Pearson, 2010.",
        "SEBBEN, A.; MARQUES, A. C. H. (Org.). Introdução à informática: uma abordagem com libreofficce. Chapecó: UFFS, 2012. 201 p. ISBN: 978-85-64905-02-3. Disponível em: <cc.uffs.edu.br\/downloads\/ebooks\/Introducao_a_Informatica.pdf>. Acesso em: 10 ago. 2012."
    ],
    "referencias_complementares": [
        "FEDELI, Ricardo D.; POLLONI, Enrico G. P.; PERES, Fernando E. Introdução à ciência da computação. 2. ed. São Paulo: CENGAGE Learning, 2010.",
        "HILL, Benjamin Mako; BACON, Jono. O livro oficial do Ubuntu. 2. ed. Porto Alegre: Bookman, 2008.",
        "LANCHARRO, Eduardo Alcalde; LOPEZ, Miguel Garcia; FERNANDEZ, Salvador Peñuelas. Informática básica. São Paulo: Pearson Makron Books, 2004.",
        "MANZANO, André Luiz N. G.; TAKA, Carlos Eduardo M. Estudo dirigido de microsoft windows 7 ultimate. São Paulo: Érica, 2010.",
        "MEYER, M.; BABER, R.; PFAFFENBERGER, B. Nosso futuro e o computador. Porto Alegre: Bookman, 1999.",
        "MONTEIRO, M. A. Introdução à organização de computadores. 5. ed. Rio de Janeiro: LTC, 2007.",
        "MORGADO, Flavio. Formatando teses e monografias com BrOffice. Rio de Janeiro: Ciência Moderna, 2008.",
        "SCHECHTER, Renato. BROffice Calc e Writer: trabalhe com planilhas e textos em software livre. Rio de Janeiro: Elsevier, 2006."
    ]
}