{
    "creditos": 4,
    "codigo": "GEX210",
    "ementa": "Noções básicas de Estatística. Séries e gráficos estatísticos. Distribuições de frequências. Medidas de tendência central. Medidas de dispersão. Medidas separatrizes. Análise de Assimetria. Noções de probabilidade e inferência.",
    "horas": 60,
    "nome": "ESTATÍSTICA BÁSICA",
    "objetivo": "Utilizar ferramentas da estatística descritiva para interpretar, analisar e sintetizar dados estatísticos com vistas à compreensão de contextos diversos.",
    "referencias_basicas": [
        "BARBETTA, P. A. Estatística aplicada às Ciências Sociais. 7. ed. Florianópolis: UFSC, 2007.",
        "BUSSAB, Wilton de Oliveira; MORETTIN, Pedro Alberto. Estatística Básica. 7. ed. rev. São Paulo: Saraiva, 2011.",
        "CRESPO, A. A. Estatística Fácil. 19. ed. São Paulo: Saraiva, 2009.",
        "FONSECA, Jairo Simon da; MARTINS, Gilberto de Andrade. Curso de Estatística. 6. ed. 12. reimpr. São Paulo: Atlas, 2009.",
        "SILVA, E. M. et al. Estatística para os cursos de: Economia, Administração e Ciências Contábeis. 4. ed. São Paulo: Atlas, 2010.",
        "TOLEDO, G. L.; OVALLE, I. I. Estatística Básica. 2. ed. São Paulo: Atlas, 1985."
    ],
    "referencias_complementares": [
        "BORNIA, Antonio Cezar; REIS, Marcelo Menezes; BARBETTA, Pedro Alberto. Estatística para cursos de engenharia e informática. 3. ed. São Paulo: Atlas, 2010.",
        "BUSSAB, Bolfarine H.; BUSSAB, Wilton O. Elementos de Amostragem. São Paulo: Blucher, 2005.",
        "CARVALHO, S. Estatística Básica: teoria e 150 questões. 2. ed. Rio de Janeiro: Elsevier, 2006.",
        "GERARDI, Lúcia H. O.; SILVA, Barbara-Cristine N. Quantificação em Geografia. São Paulo: DIFEl, 1981.",
        "LAPPONI, Juan Carlos. Estatística usando Excel. 4. ed. rev. Rio de Janeiro: Campus, 2005.",
        "MAGALHÃES, Marcos Nascimento; LIMA, Antônio Carlos Pedroso de. Noções de Probabilidade e Estatística. 7. ed. São Paulo: EDUSP, 2010.",
        "MONTGOMERY, Douglas C.; RUNGER, George C.; HUBELE, Norma F. Estatística aplicada à engenharia. 2. ed. Rio de Janeiro: LTC, 2011.",
        "ROGERSON, P. A. Métodos Estatísticos para Geografia: um guia para o etudante. 3. ed. Porto Alegre: Boockman, 2012.",
        "SILVA, E. M. et al. Estatística para os cursos de: Economia, Administração e Ciências Contábeis. 2. ed. São Paulo: Atlas, 1996.",
        "SPIEGEL, M. R. Estatística. 3. ed. São Paulo: Makron Books, 1993.",
        "TRIOLA, Mario F. Introdução à Estatística. 10. ed. Rio de Janeiro: LTC, 2008.",
        "VIEIRA, S.; HOFFMANN, R. Elementos de Estatística. 4. ed. São Paulo: Atlas, 2010."
    ]
}