{
    "creditos": 4,
    "codigo": "GEX392",
    "ementa": "Algumas técnicas de integração e aplicações da integral. Funções de várias variáveis. Limite e continuidade de funções de várias variáveis. Derivadas parciais e aplicações. Gradiente. Diferenciabilidade. Multiplicadores de Lagrange. Integrais múltiplas.",
    "horas": 60,
    "nome": "CÁLCULO II",
    "objetivo": "Estudar mais algumas técnicas de integração de uma função de uma variável e aplicá-las na resolução de problemas. Introduzir as principais ferramentas do cálculo diferencial e integral de funções de várias variáveis, abordando suas aplicações.",
    "referencias_basicas": [
        "FLEMMING, D. M.; GONÇALVES, M. B. Cálculo A: funções, limite, derivação e integração. 6. ed. São Paulo: Makron Books, 2007.",
        "______. Cálculo B: funções de várias variáveis, integrais múltiplas, integrais curvilíneas e de superfície. 6. ed. São Paulo: Makron Books, 2007.",
        "GUIDORIZZI, H. L. Um curso de cálculo. 5. ed. Rio de Janeiro: LTC, 2001. v. 2 e 3.",
        "LEITHOLD, L. O cálculo com geometria analítica. 3. ed. São Paulo: Harbra, 1994. 1 v.",
        "______.O cálculo com geometria analítica. 3. ed. São Paulo: Harbra, 1994. 2 v.",
        "STEWART, J. Cálculo. 6. ed. São Paulo: Cengage Learning, 2010. 1 v.",
        "______.Cálculo. 6. ed. São Paulo: Cengage Learning, 2010. 2 v.",
        "THOMAS, G. B. Cálculo. 11. ed. São Paulo: Addison Wesley, 2008. 1 v.",
        "______.Cálculo. 11. ed. São Paulo: Addison Wesley, 2008. 2 v."
    ],
    "referencias_complementares": [
        "ANTON, H.; BIVENS, I.; DAVIS, S. Cálculo. 8. ed. São Paulo: Bookman, 2007. v. 2.",
        "______. Cálculo. 8. ed. São Paulo: Bookman, 2007. v. 1.",
        "APOSTOL, T. M. Calculus: one-variable calculus, with an introduction to linear algebra. 2. ed. New York: John Wiley & Sons, 1967. v. 1.",
        "______. Calculus: one-variable calculus, with an introduction to linear algebra. 2. ed. New York: John Wiley & Sons, 1967. v. 2.",
        "LARSON, R.; HOSTETLER, R. P.; EDWARDS, B. H. Cálculo. 8. ed. São Paulo: McGraw Hill, 2006. 1 v.",
        "______. Cálculo. 8 ed. São Paulo: McGraw Hill, 2006. 2 v.",
        "SALAS, H. E. Cálculo. 9. ed. Rio de Janeiro: LTC, 2005. 1 v.",
        "______. Cálculo. 9. ed. Rio de Janeiro: LTC, 2005. 2 v.",
        "SIMMONS, G. F. Cálculo com geometria analítica. São Paulo: McGraw Hill, 1987. 1 v.",
        "______. Cálculo com geometria analítica. São Paulo: McGraw Hill, 1987. 2 v."
    ]
}