{
    "creditos": 4,
    "codigo": "GEX395",
    "ementa": "Erros computacionais e aproximação numérica. Cálculo de raízes de funções reais. Resolução de sistemas lineares: métodos diretos e iterativos. Interpolação polinomial. Ajuste de curvas: quadrados mínimos lineares. Diferenciação e integração numérica. Tratamento numérico de equações diferenciais ordinárias.",
    "horas": 60,
    "nome": "CÁLCULO NUMÉRICO",
    "objetivo": "Abordar a resolução não algébrica de problemas matemáticos por meio de métodos numéricos, fazendo uso de ferramentas do cálculo diferencial e integral, da álgebra linear e de equações diferenciais ordinárias.",
    "referencias_basicas": [
        "BARROSO, L. C. et al. Cálculo numérico (com aplicações). São Paulo: Harbra, 1987.",
        "FRANCO, N. M. B. Cálculo numérico. São Paulo: Prentice Hall, 2007.",
        "HUMES, A. F. P. C. et al. Noções de cálculo numérico. São Paulo: McGraw Hill, 1984.",
        "RUGGIERO, M. A. G.; LOPES, V. L. R. Cálculo numérico – aspectos teóricos e computacionais. 2. ed. São Paulo: Makron Books, 1996."
    ],
    "referencias_complementares": [
        "BURIAN, R.; LIMA, A. C. Fundamentos de informática – cálculo numérico. Rio de Janeiro: LTC, 2007.",
        "CLÁUDIO, D. M.; MARINS, J. M. Cálculo numérico computacional – teoria e prática. São Paulo: Atlas, 1989.",
        "CHRISTOFOLETTI, A. Modelagem de sistemas ambientais. São Paulo: Edgard Blucher, 1999. 256 p.",
        "CUNHA, M. C. Métodos Numéricos. Campinas: UNICAMP, 2000.",
        "MEYER, C. D. Matrix analysis and applied linear algebra. New York: SIAM, 2000.",
        "ROQUE, W. L. Introdução ao cálculo numérico. São Paulo: Atlas, 2000.",
        "WATKINS, D. S. Fundamentals of matrix computations. New York: John Wiley and Sons, 1991."
    ]
}