{
    "creditos": 4,
    "codigo": "GEX439",
    "ementa": "Dispositivos e redes móveis. Mobilidade de código e agentes móveis. Computação nômade e computação móvel. Computação pervasiva e ubíqua. Arquitetura de software móvel. Computação ciente-de-contexto: adaptação dinâmica, middlewares de reconhecimento de contexto, linguagens de descrição de contexto. Comunicação com IP Móvel. Redes ad hoc Móveis: protocolos em redes ad hoc móveis. Sistemas Voláteis. Serviços de Descoberta de Serviços. Segurança e Privacidade. Adaptação. Estudos de casos.",
    "horas": 60,
    "nome": "COMPUTAÇÃO MÓVEL",
    "objetivo": "Compreender e aplicar paradigmas e modelos da Computação Móvel.",
    "referencias_basicas": [
        "ADELSTEIN, F. et al. Fundamentals of Mobile and Pervasive Computing. McGraw- Hill, 2005.",
        "BIGUS, Joseph; BIGUS, Jennifer. Construcuting Intelligents Agents with Java. John Wiley, 1998.",
        "COULOURIS, G. et al. Distributed Systems: Concepts and Design. 4. ed. Addison Wesley, 2005.",
        "PITOURA, Evaggelia; SAMARAS, George. Data Management for Mobile Computing. Kluwer Academic Publishers, 1998.",
        "SCHILLER, J. Mobile Communications. Addison Wesley, 2000.",
        "WOOLDRIDGE, Michel. An Introduction to Multiagent Systems. John Wiley, 2002."
    ],
    "referencias_complementares": [
        "BRENNER, Walter; ZARNEKOW, Rudiger; WITTIG, Harmut. Intelligent Software Agents: Foundations and Applications. Springer, 1998.",
        "LANGE, Danny B.; OSHIMA, Mitsuru. Programming and Deploying Java Mobile Agents with Aglets. Addison Wesley, 1998.",
        "MATEUS, Geraldo Robson; LOUREIRO, Antonio Alfredo F. Introdução à Computação Móvel. 11ª Escola de Computação, COPPE\/Sistemas, NCE\/UFRJ, 1998.",
        "SCHILLER, J.; VOISARD, A. Location-Based Services. Elsevier, 2004."
    ]
}