{
    "creditos": 4,
    "codigo": "GEX441",
    "ementa": "Modelagem. Modelos lineares determinísticos contínuos: revisão de álgebra linear, programação linear, simplex e sensibilidade. Modelos determinísticos lineares discretos: problemas simples em redes, programação linear inteira, cortes e branch-and-bound. Processos de decisão sequencial: programação dinâmica e heurística. Cadeias de Markov: estabilidade e otimalidade, aplicação a filas elementares.",
    "horas": 60,
    "nome": "PESQUISA OPERACIONAL",
    "objetivo": "Aplicar métodos matemáticos de otimização a modelos de decisão.",
    "referencias_basicas": [
        "BAZARAA, M. S.; JARVIS, J. J.; SHERALI, M. D. Linear programming and network flows. 2. ed. New York: Wiley, 1990. 1 v.",
        "COLIN, Emerson Carlos. Pesquisa Operacional: 170 aplicações em estratégia, finanças, logística, produção, marketing e vendas. Rio de Janeiro: LTC, 2007.",
        "GOLDBARG, M. C.; LUNA, Henrique Pacca L. Otimização combinatória e programação linear: modelos e algoritmos. Rio de Janeiro: Campus, 2002.",
        "HEIN, N.; LOESCH, C. Pesquisa Operacional: fundamentos e modelos. São Paulo: Saraiva, 2009.",
        "MOREIRA, D. A. Pesquisa Operacional: curso introdutório. São Paulo: Thomson Learning, 2007.",
        "WAGNER, H. M. Pesquisa Operacional. 2. ed. Rio de Janeiro: Prentice Hall do Brasil, 1986."
    ],
    "referencias_complementares": [
        "ANDRADE, E. L. Introdução à Pesquisa Operacional: métodos e técnicas de análise de decisão. Rio de Janeiro: LTC – Livros Técnicos e Científicos, 2004.",
        "ANDRADE, Edgard; FURST, Patricia; RODRIGUES, Paulo C. Parga. Elementos de programação linear. Rio de Janeiro: Universidade Rural, 1998. 168 p.",
        "BUENO, Fabrício. Otimização Gerencial com Excel. Florianópolis: Visualbooks, 2007.",
        "CAIXETA FILHO, J. V. Material de Apoio às Disciplinas: Introdução à Pesquisa Operacional Programação Linear. Piracicaba: Esalq, 1996. (Série Didática n.113).",
        "CORRAR, L. J.; THEOPHILO, C. R. Pesquisa Operacional para Decisão em Contabilidade e Administração. São Paulo: Editora Atlas, 2004.",
        "FANG, S.; PUTHENPURA, Sarat. Linear optimization and extensions: theory and algorithms. At & T. New Jersey: Prentice Hall, 1993. 1 v.",
        "HILLIER, F.; LIEBERMAN, Gerald J. Introduction to mathematical programming. 2. ed. Singapore: MCGraw-Hill, 1995. 1 v.",
        "LACHTERMACHER, G. Pesquisa Operacional na Tomada de Decisões. Modelagem em Excel. Rio de Janeiro: Campus, 2006.",
        "PRADO, D. S. PERT\/CPM. Belo Horizonte: Desenvolvimento Gerencial, 1998. 148 p. v. 4. (Série Gerência de Projetos).",
        "____________. Programação Linear. Belo Horizonte: Desenvolvimento Gerencial, 2003. v. 1. (Série Pesquisa Operacional).",
        "WINSTON, W. L. Operations Research: Applications and Algorithms. 3. ed. Duxbury Press, 1994."
    ]
}