{
    "creditos": 4,
    "codigo": "GEX606",
    "ementa": "Dispositivos Lógicos Programáveis. Introdução à Linguagem de Descrição de Hardware. Prototipação de hardware utilizando FPGAs. Máquinas Sequenciais Síncronas (Mealy e Moore). Síntese de Circuitos Sequenciais. Descrição de Sistemas Digitais no nível de RT. Projeto de Sistemas Digitais no nível de RT (datapath x controle).",
    "horas": 60,
    "nome": "SISTEMAS DIGITAIS",
    "objetivo": "Compreender os conceitos e o funcionamento de circuitos digitais utilizados em computação, através da apresentação de técnicas de projeto e simulação e implementação usando linguagens de descrição de hardware e tecnologias de prototipação.",
    "referencias_basicas": [
        "ASHENDEN, Peter J. The Students guide to VHDL. Morgan Kaufmann, 2008.",
        "D'AMORE, Roberto. VHDL: Descrição e Síntese de Circuitos Digitais. Rio de Janeiro: LTC, 2005.",
        "HARRIS, David M.; HARRIS, Sarah L. Digital Design and Computer Architecture. Rio de Janeiro: Elsevier, 2007.",
        "TOCCI, Ronald; WIDMER, Neal; MOSS, Gregory. Sistemas Digitais: princípios e aplicações. 10. ed. São Paulo: Pearson, 2007."
    ],
    "referencias_complementares": [
        "IDOETA, Ivan V.; CAPUANO, Francisco G. Elementos de Eletrônica Digital. 37. ed. São Paulo: Livros Érica Editora Ltda, 2006.",
        "MELO, Mairton de Oliveira. Eletrônica Digital. São Paulo: Makron Books, 1994.",
        "OSBORNE, Adam. Microprocessadores – Circuitos Básicos. São Paulo: McGraw-Hill, 1983.",
        "TAUB, Herbert; SCHILLING, Donald. Eletrônica Digital. São Paulo: McGraw-Hill, 1982.",
        "TAUB, Herbert. Circuitos Digitais e Microprocessadores. São Paulo: McGraw-Hill, 1984.",
        "TOKHEIN, Roger. Introdução aos Microprocessadores. São Paulo: McGraw-Hill, 1985."
    ]
}