{
    "creditos": 4,
    "codigo": "GEX607",
    "ementa": "Matrizes. Determinantes. Sistemas de equações lineares. Espaços vetoriais. Transformações lineares. Espaços com produto interno. Autovalores e autovetores. Diagonalização.",
    "horas": 60,
    "nome": "ÁLGEBRA LINEAR",
    "objetivo": "Resolver sistemas de equações lineares utilizando operações elementares. Calcular a inversa de matrizes usando operações elementares. Compreender os conceitos de transformação linear, autovalor, autovetor e ter contato com aplicações da Álgebra Linear em problemas reais.",
    "referencias_basicas": [
        "ANTON, H.; RORRES, C. Álgebra linear com aplicações. 8. ed. Porto Alegre: Bookman, 2001.",
        "BOLDRINI, J. L. et al. Álgebra linear. 3. ed. São Paulo: HARBRA, 1986.",
        "LEON, S. J. Álgebra linear com aplicações. 4. ed. Rio de Janeiro: LTC, 1999.",
        "POOLE, D. Álgebra Linear. São Paulo: Pioneira Thomson Learning, 2004."
    ],
    "referencias_complementares": [
        "CALLIOLI, C.; DOMINGUES, H.; COSTA, R. Álgebra linear e aplicações. 6. ed. São Paulo: Atual, 2006.",
        "COELHO, F.; LOURENÇO, M. Um curso de álgebra linear. São Paulo: EDUSP, 2002.",
        "DUNN, F.; PARBERRY, I. 3D Math Primer for Graphics and Game Development. 2. ed. A K Peters\/CRC Press, 2011. ISBN-10: 1568817231.",
        "KOLMAN, B.; HILL, D. R. Introdução à álgebra linear com aplicações. Rio de Janeiro: LTC, 2006.",
        "LENGYEL, E. Mathematics for 3D game programming and computer graphics. 3. ed. Course Technology PTR, 2011. ISBN-10: 1435458869.",
        "LIPSCHUTZ, S. Álgebra Linear: teoria e problemas. 3. ed. São Paulo: Makron Books, 1994.",
        "SANTOS, R. J. Geometria analítica e álgebra linear. Disponível em: <http:\/\/www.mat.ufmg.br\/~regi>. Acesso em: 22 nov. 2011.",
        "STEINBRUCH, A.; WINTERLE, P. Álgebra linear. São Paulo: McGraw-Hill, 1987.",
        "VERTH, J.; BISHOP, L. Essential Mathematics for Games and Interactive Applications: A Programmer's Guide. 2. ed. Morgan Kaufmann, 2008. ISBN-10: 0123742978."
    ]
}