{
    "creditos": 4,
    "codigo": "GEX615",
    "ementa": "Engenharia de software: evolução, conceito e objetivo. Processo e ciclo de vida de desenvolvimento de software. Métodos de análise e de projeto de software. Engenharia de requisitos. Gerenciamento de configuração de software e ferramentas para controle de versão. Verificação, validação e teste. Entrega e manutenção. Medição de software. Garantia da qualidade de software. Métodos ágeis de desenvolvimento de software. Comparação entre métodos ágeis e métodos tradicionais. Ambientes de desenvolvimento de software.",
    "horas": 60,
    "nome": "ENGENHARIA DE SOFTWARE I",
    "objetivo": "Compreender o processo completo de desenvolvimento de produtos de software e os procedimentos necessários, com ênfase no planejamento e melhoria contínua.",
    "referencias_basicas": [
        "PFLEEGER, S. L. Engenharia de Software. 2. ed. São Paulo: Prentice Hall, 2004.",
        "PRESSMAN, R. S. Engenharia de Software. 7. ed. São Paulo: Bookman Companhia, 2011.",
        "SOMMERVILLE, I. Engenharia de Software. 8. ed. São Paulo: Addison - Wesley, 2008.",
        "WAZLAWICK, R. S. Engenharia de Software: Conceitos e prática. Rio de Janeiro: Elsevier, 2013.",
        "REFERÊNCIAS",
        "ANSELMO, F. Métricas para desenvolvedores. Florianópolis: Visual Books, 2010.",
        "BASTOS, A. Base de Conhecimento em Teste de Software. São Paulo: Martins, 2012.",
        "LARMAN, C. Agile And Iterative Development. São Paulo: Prentice-Hall, 2003.",
        "SOFTEX. MPS.BR – Melhoria de Processo do Software Brasileiro – Guia Geral. Softex, 2011.",
        "POPPENDIECK, M.; POPPENDIECK, T. Implementando o desenvolvimento lean de software. Porto Alegre: BOOKMAN, 2010.",
        "RIOS, E. Análise de Riscos em Projetos de Teste de Software. Rio de Janeiro: Alta Books, 2005.",
        "SBROCCO, J. H. T.; MACEDO, P. C. Metodologias ágeis – engenharia de software sob medida. São Paulo: Érica, 2012.",
        "SOFTWARE ENGINEERING INSTITUTE. CMMI for Development, Version 1.2 – CMMI-DEV, V1.3. Software Engineering Institute, 2010.",
        "TONSIG, S. L. Engenharia de Software: Análise e Projeto de Sistemas. São Paulo: Futura, 2003.",
        "YOUNG, M.; PEZZE, M. Teste e análise de software – processos, princípios e técnicas. Porto Alegre: Bookman, 2008."
    ]
}