{
    "creditos": 4,
    "codigo": "GEX612",
    "ementa": "Tendências tecnológicas de CPUs, memórias e barramentos. Hierarquia de memória e associatividade (cache e TLB). Dispositivos de entrada e saída: tipos, características e sua conexão à CPU e à memória. Comunicação com a CPU (polling, interrupção, DMA). CPU: instruções e modos de endereçamento. Formatos de instruções e linguagem de montagem. Simulador e montador. Exceções e interrupções. Medidas de desempenho.",
    "horas": 60,
    "nome": "ORGANIZAÇÃO DE COMPUTADORES",
    "objetivo": "Conhecer os principais conceitos envolvidos na concepção da arquitetura e organização dos computadores, sabendo caracterizar e entender o funcionamento interno de um computador, dada uma certa arquitetura, reconhecendo o impacto de cada alternativa sobre fatores como desempenho e custo.",
    "referencias_basicas": [
        "MONTEIRO, Mario A. Introdução à Organização de Computadores. 5. ed. Rio de Janeiro: LTC, 2011.",
        "PATTERSON, David A.; HENNESSY, John L. Organização e Projeto de Computadores. 3. ed. Rio de Janeiro: Campus, 2005.",
        "STALLINGS, W. Arquitetura e Organização de Computadores. 8. ed. São Paulo: Prentice Hall, 2010.",
        "TANENBAUM, Andrew S. Organização Estruturada de Computadores. 5. ed. Rio de Janeiro: Prentice-Hall do Brasil, 2006."
    ],
    "referencias_complementares": [
        "HARRIS, David Money. Digital Design and Computer Architecture. Amsterdam: Elsevier, 2007.",
        "HENNESSY, John L. Arquitetura de Computadores: uma abordagem quantitativa. Rio de Janeiro: Campus, 2003.",
        "HEURING, Vincent P. Computer Systems Design and Architecture. 2. ed. Upper Saddle River-NJ: Pearson Prentice Hall, 2004.",
        "MANO, M. Computer System Architecture. Englewood Cliffs-NJ: Prentice-Hall International, 1993.",
        "MURDOCCA, Miles J. Introdução à Arquitetura de Computadores. Rio de Janeiro: Campus, 2001.",
        "STALLINGS, William. Arquitetura e Organização de Computadores: projeto para o desempenho. 5. ed. São Paulo: Prentice Hall, 2005."
    ]
}