{
    "creditos": 4,
    "codigo": "GEX656",
    "ementa": "Preceitos e contribuições dos estudos CTS. Definições de ciência, tecnologia e técnica. As imagens da tecnologia. Relações entre ciência, tecnologia e sociedade. Desenvolvimento tecnológico e desenvolvimento social. Difusão de novas tecnologias. Sociedade tecnológica e suas implicações. As noções de risco e de impacto tecnológico. Modelos de produção e modelos de sociedade. Influências da ciência e da tecnologia na organização social. Questões contemporâneas.",
    "horas": 60,
    "nome": "TECNOLOGIA E DESENVOLVIMENTO",
    "objetivo": "Apresentar a imbricada relação entre ciência, tecnologia e sociedade por meio da discussão e da análise crítica do desenvolvimento científico e tecnológico e das suas implicações na sociedade.",
    "referencias_basicas": [
        "BAZZO, Walter A.; VON LINSINGEN, Irlan; PEREIRA, Luiz T. V. Introdução aos estudos CTS. OEI, Madrid, 2003.",
        "BAZZO, Walter A. Ciência, tecnologia e sociedade e o contexto da educação tecnológica. 4.ed. Florianópolis: EdUFSC, 2014.",
        "BAZZO, Walter A.; PEREIRA, Luiz T. V.; Bazzo, Jilvânia L. S. Conversando sobre educação tecnológica. Florianópolis: EdUFSC, 2014.",
        "DAGNINO, Renato. Ciência e tecnologia no Brasil: O processo decisório e a comunidade de pesquisa. Campinas: Unicamp, 2007",
        "___________________. Neutralidade da ciência e determinismo tecnológico: um debate sobre a tecnociência. Campinas: Unicamp, 2008.",
        "POSTMAN, Neil. Tecnopólio. A rendição da cultura à tecnologia. São Paulo: Nobel, 1994.",
        "TORTAJADA, José Félix Tezanos; PELÁEZ, Antonio López. Ciencia, tecnologia y sociedad. Madrid: Sistema, 1997."
    ],
    "referencias_complementares": [
        "BAZZO, Walter A. De técnico e de humano: questões contemporâneas. Florianópolis: EdUFSC, 2015.",
        "DAGNINO, Renato. Tecnologia social: ferramenta para construir outra sociedade \/ Renato",
        "Dagnino (Org. colaboradores Bagattolli, Carolina ...[et al.] . -- Campinas,SP.: IG\/UNICAMP, 2009"
    ]
}