{
    "creditos": 4,
    "codigo": "GEX608",
    "ementa": "Noções de Lógica e de Teoria dos Conjuntos. Relações. Funções. Prova por redução ao absurdo, por indução e por indução generalizada. Recorrências lineares. Combinatória finita: princípios aditivos, multiplicativo e da casa dos pombos, permutações, combinações e binômio de Newton. Notação, definições e introdução a lógica matemática e teoria dos conjuntos. Relações, funções, números naturais, conjuntos contáveis e incontáveis, indução matemática, relações de recorrência.",
    "horas": 60,
    "nome": "MATEMÁTICA DISCRETA",
    "objetivo": "Compreender os fundamentos matemáticos necessários às diversas disciplinas da Ciência da Computação. Desenvolver o formalismo e as habilidades de redação de demonstrações matemáticas através de exercícios. Relacionar os elementos matemáticos discretos com suas aplicações computacionais.",
    "referencias_basicas": [
        "GERSTING, J. Fundamentos Matemáticos para a Ciência da Computação. 5. ed. LTC, 2004.",
        "GRAHAN, J.; KNUTH, D. E.; PATASHNIK, O. Matemática Concreta: Fundamentos para a Ciência da Computação. 2. ed. LTC, 1995.",
        "LEWIS, H. R.; PAPADIMITRIOU, C. H. Elementos de Teoria da Computação. 2. ed.",
        "Bookman, 2000.",
        "LIPSCHUTZ, S.; LIPSON, M. Teoria e Problemas de Matemática Discreta. 2. ed.",
        "Bookman, 2004.",
        "ROSEN, K. H. Matemática Discreta e Suas Aplicações. 6. ed. McGraw-Hill, 2009."
    ],
    "referencias_complementares": [
        "CORMEN, T. H. et al. Algoritmos: Teoria e Prática. 3. ed. Elsevier, 2012.",
        "GREENE, D. H.; KNUTH, D. E. Mathematics For The Analysis Of Algorithms. 3. ed. Birkhäuser, 2007.",
        "LOVÁSZ, L.; PELIKAN, J.; VERSZTERGOMBI. Matemática Discreta. 1. ed. Sociedade Brasileira de Matemática, 2003.",
        "MENEZES, P. B. Matemática Discreta para Computação e Informática. 3. ed. Bookman, 2010.",
        "TREMBLAY, J. P. Discrete Mathematical Structures With Applications to Computer Science. 1. ed. McGraw-Hill, 1975."
    ]
}