{
    "creditos": 4,
    "codigo": "GEX654",
    "ementa": "Algoritmos de Monte Carlo e de Las Vegas. Algoritmos probabilísticos para os problemas de satisfatibilidade MAX SAT e MAX 3-SAT. Quicksort aleatorizado. Máquinas de Turing probabilísticas. Classes computacionais probabilísticas. Passeios aleatórios em grafos. Algoritmos distribuídos aleatorizados. Testes de primalidade aleatorizados.",
    "horas": 60,
    "nome": "COMPUTAÇÃO ALEATORIZADA",
    "objetivo": "Estudar os principais algoritmos aleatorizados clássicos e dominar a fundamentação teórica da Computação Aleatorizada. Observar o papel prático da aleatoriedade na Computação enquanto estratégia de projeto de algoritmos mais eficientes e de soluções para problemas ainda intratáveis deterministicamente. Compreender a importância das classes de complexidade probabilísticas para as mais importantes questões da Teoria da Computação.",
    "referencias_basicas": [
        "ALON, N.; SPENCER, J. H. The Probabilistic Method. 3. ed. Wiley-Interscience, 2008.",
        "CHAZELLE, B. The Discrepancy Method: Randomness and Complexity. 1. ed. Cambridge University Press, 2002.",
        "MITZENMACHER, M.; UPFAL, E. Probability and Computing: Randomized Algorithms and Probabilistic Analysis. 1. ed. Cambridge University Press, 2005."
    ],
    "referencias_complementares": [
        "CORMEN, T. H. e al. Algoritmos: Teoria e Prática. 3. ed. Elsevier, 2012.",
        "FELLER, W. An Introduction To Probability Theory And Its Applications. 3. ed. Wiley, 1968.",
        "HOPCROFT, J. E.; MOTWANI, R.; ULLMAN, J. D. Introdução À Teoria Dos Autômatos, Linguagens E Computação. 1. ed. Rio de Janeiro: Campus, 2002.",
        "KLEINBERG, J.; TARDOS, E. Algorithm Design. 1. ed. Addison Wesley, 2005.",
        "PAPADIMITRIOU, C. H. Computational Complexity. 1. ed. Addison Wesley, 2003."
    ]
}