{
    "creditos": 4,
    "codigo": "GEX622",
    "ementa": "Conceitos e aplicações de modelagem e simulação. Propriedades, classificação e processo de projeto de modelos de simulação. Simulação discreta e contínua. Escalonamento, probabilidade e variabilidade em modelos. Metodologias, técnicas e ferramentas para modelagem e simulação computacional. Verificação e validação de modelos. Simulação paralela e distribuída. Modelos heterogêneos e de sincronização híbrida. Arquiteturas e formalismos de simulação. Estudos de casos e tendências em simulação computacional.",
    "horas": 60,
    "nome": "MODELAGEM E SIMULAÇÃO",
    "objetivo": "Fornecer fundamentos teóricos e práticos para o desenvolvimento de mecanismos de suporte a simulação de sistemas e de modelos de simulação como ferramenta de apoio à verificação, validação, construção de sistemas reais, de treinamento, entre outras aplicações",
    "referencias_basicas": [
        "CHWIF, Leonardo; MEDINA, Afonso C. Modelagem e Simulação de Eventos Discretos. 2. ed. São Paulo: Dos Autores, 2007.",
        "FREITAS FILHO, P. J. Introdução à Modelagem e Simulação de Sistemas com aplicações em arena. São Paulo: Visual Books, 2008.",
        "FUJIMOTO, T. M. Parallel and distributed simulation. John Wiley, 2000."
    ],
    "referencias_complementares": [
        "SEVERANCE, Frank L. System modeling and simulation: an introduction. Chichester; New York: J. Wiley, 2001",
        "KOSTIN, Alexander; ILUSHECHKINA, Ljudmila. Modeling and simulation of distribuited systems. New Jersey: World Scientific, 2010. 419 p",
        "HAMILTON, John A; NASH, David A; POOCH, Udo W. Distributed simulation. Boca Raton, Fla.: CRC Press, c1997. 390 p."
    ]
}