{
    "creditos": 4,
    "codigo": "GEX653",
    "ementa": "Introdução à programação de Shaders. Diversos tipos de mapeamento de textura: mapeamento de rugosidade (bump mapping), mapeamento de ambiente (environment mapping), mapeamento de reflexão (reflection mapping), mapeamento de relevo (relief mapping). Algoritmos para geração de sombras. Equação de Rendering. Modelos de iluminação. Algoritmos de iluminação global. Ray tracing. Radiosidade. Photon mapping. Pre-computed radiance transfer. Rendering baseado em imagens. Iluminação baseada em imagens.",
    "horas": 60,
    "nome": "COMPUTAÇÃO GRÁFICA AVANÇADA",
    "objetivo": "Familiarizar os estudantes com técnicas avançadas de rendering, provendo experiência prática na programação de shaders e na implementação de algoritmos de iluminação global e de image-based rendering. Propiciar aos estudantes a oportunidade de desenvolver um projeto na área de rendering.",
    "referencias_basicas": [
        "AKENINE-MOLLER, T.; HAINES, E.; HOFFMAN, N. Real-Time Rendering. 3. ed. AK Peters, 2008.",
        "DUTRE, P.; BEKAERT, P.; BALA, K. Advanced Global Illumination. A K Peters\/CRC Press, 2006.",
        "HUGHES, J.; DAM, A.; MCGUIRE, M.; SKLAR, D.; FOLEY, J.; FEINER, S.; AKELEY, A. Computer Graphics: Principles and Practice. 3. ed. Addison-Wesley Professional, 2013. ISBN-10: 0321399528.",
        "SHIRLEY, P. Realistic Ray Tracing. 2. ed. AK Peters, 2003.",
        "___________. Fundamentals of Computer Graphics. 3. ed. AK Peters, 2009."
    ],
    "referencias_complementares": [
        "ANGEL, E.; SHEREINER, D. Interactive Computer Graphics: A Top-Down Approach with Shader-Based OpenGL. 6. ed. Addison-Wesley, 2011. ISBN-10: 0132545233.",
        "LENGYEL, E. Mathematics for 3D game programming and computer graphics. 3. ed. Course Technology PTR, 2011. ISBN-10: 1435458869.",
        "VERTH, J.; BISHOP, L. Essential Mathematics for Games and Interactive Applications: A Programmer's Guide. 2. ed. Morgan Kaufmann, 2008. ISBN-10: 0123742978."
    ]
}