{
    "creditos": 4,
    "codigo": "GEX617",
    "ementa": "Evolução das principais linguagens de programação. Sintaxe e Semântica. Nomes. Vinculação\/Amarração. Verificação de tipos e escopos. Tipos de dados. Expressões e instruções de atribuição. Estruturas de controle no nível da instrução. Subprogramas. Tipos abstratos de dados. Concorrência. Tratamento de Exceções. Linguagens declarativas: lógicas, funcionais, com restrições.",
    "horas": 60,
    "nome": "LINGUAGENS DE PROGRAMAÇÃO",
    "objetivo": "Entender a classificação das linguagens de programação e seu contexto histórico. Compreender os aspectos técnicos de implementação dos diferentes recursos oferecidos pelas principais linguagens. Adquirir a experiência de programar em paradigmas não- usuais de programação a fins de comparação nos mais diversos contextos.",
    "referencias_basicas": [
        "LOUDEN, K. C.; LAMBERT, K. A. Programming Languages: Principles And Practices. 3. ed. Hardcover, 2011.",
        "PRATT, T. W.; ZELKOWITZ, M. V. Programming Languages: Design and Implementation. 4. ed. Prentice-Hall, 2000.",
        "SEBESTA, R. W. Concepts Of Programming Languages. 10. ed. Hardcover, 2012.",
        "WATT, D. A. Conceitos de linguagens de programação. 5. ed. Porto Alegre: Bookman, 2003."
    ],
    "referencias_complementares": [
        "GHEZZI, C. Conceitos de Linguagens de Programação. 2. ed. Rio de Janeiro: Campus, 1991.",
        "SEBESTA, R. W. Conceitos de Linguagens de Programação. 9. ed. Porto Alegre: Bookman, 2011.",
        "VAREJÃO, F. M. Linguagens de Programação: Conceitos e Técnicas. 1. ed. Rio de Janeiro: Campus, 2004.",
        "WATT, D. A. Programming Languages: Concepts and Paradigms. 1. ed. São Paulo: Prentice-Hall, 1990."
    ]
}