{
    "creditos": 4,
    "codigo": "GEX619",
    "ementa": "Programação competitiva. Estruturas de dados avançadas: make-union-find, árvores de segmento, árvores de Fenwick, heaps e árvores de sufixo. Algoritmos gulosos. Algoritmos de divisão e conquista. Programação dinâmica. Modelagem de problemas com grafos. Problemas combinatoriais. Problemas de Teoria dos Números. String matching. Geometria computacional.",
    "horas": 60,
    "nome": "TÉCNICAS AVANÇADAS DE PROGRAMAÇÃO",
    "objetivo": "Estudar técnicas avançadas de programação para a resolução de problemas complexos, praticando a implementação das técnicas em diversos exercícios e comparando analiticamente o resultado com os algoritmos de força bruta. Entender o conceito de ‘espaço de busca’ em problemas de otimização. Aprimorar a criatividade e as habilidades necessárias para competições de programação. Estudar algumas técnicas para a obtenção em tempo viável de soluções aproximadas para problemas NP-completos ou NP-difíceis.",
    "referencias_basicas": [
        "DASGUPTA, S.; PAPADIMITRIOU, C.; VAZIRANI, U. Algoritmos. 1. ed. McGraw-Hill Brasil, 2009.",
        "KLEINBERG, J.; TARDOS, E. Algorithm Design. 1. ed. Addison Wesley, 2005.",
        "SKIENNA, S. S. The Algorithm Design Manual. 2. ed. Springer, 2010.",
        "SKIENNA, S. S.; REVILLA, M. Programming Challenges. 1. ed. Springer, 2003."
    ],
    "referencias_complementares": [
        "BELLMAN, R.; DREYFUS, S. Dynamic Programming. 1. ed. Princeton University Press, 2010.",
        "CORMEN, T. H. et al. Algoritmos: Teoria e Prática. 3. ed. Rio de Janeiro: Elsevier, 2012.",
        "KNUTH, D. E. The Art Of Computer Programming. Addison-Wesley, 2011. v. 1–4.",
        "MANBER, U. Introduction To Algorithms: A Creative Approach. 1. ed. Addison-Wesley, 1989."
    ]
}