{
    "creditos": 4,
    "codigo": "GEX614",
    "ementa": "Introdução a modelos formais de computação. Máquinas de Turing. Funções Recursivas. Computabilidade. Decidibilidade. Classes de complexidade de problemas computacionais. Circuitos booleanos.",
    "horas": 60,
    "nome": "TEORIA DA COMPUTAÇÃO",
    "objetivo": "Compreender a importância da Teoria da Computação para a prática computacional através dos conceitos de Computabilidade, Decidibilidade, Complexidade e Tratabilidade. Desenvolver a criatividade e as habilidades de argumentação matemática e formal para demonstrações em Teoria da Computação. Entender o problema ‘P versus NP’. Dominar os principais problemas computacionais NP-Completos e o papel de cada um nas mais diversas áreas da Ciência da Computação.",
    "referencias_basicas": [
        "PAPADIMITRIOU, C. H. Computational Complexity. 1. ed. Addison Wesley, 1993.",
        "HOPCROFT, J. E.; MOTWANI, R.; ULLMAN, J. D. Introdução À Teoria Dos Autômatos, Linguagens e Computação. 1. ed. Campus, 2002.",
        "SIEPSER, M. Introduction to the Theory of Computation. 3. ed. Course Technology, 2012.",
        "DAVIS, M. D.; SIGAL, R.; WEYUKER, E. J. Computability, Complexity and Languages: Fundamentals of Theoretical Computer Science. 2. ed. Morgan Kaufmann, 1994.",
        "CORMEN, T.; RIVEST, R.; STEIN, C.; LEISERSON, C. Algoritmos: Teoria e Prática. Rio de Janeiro: Elsevier – Campus, 2012."
    ],
    "referencias_complementares": [
        "CARNIELLI, W.; EPSTEIN, R. L. Computabilidade, Funções Computáveis, Lógica e os Fundamentos da Matemática. 2. ed. São Paulo: Unesp, 2009.",
        "DIVERIO, T. A.; MENEZES, P. B. Teoria da Computação: Máquinas Universais e Computabilidade. 3. ed. Porto Alegre: Bookman, 2011.",
        "SUDKAMP, T. A. Languages and Machines: An Introduction to the Theory of Computer Science. 3. ed. Addison Wesley, 2005.",
        "WOOD, D. Theory Of Computation. 1. ed. Longman Higher Education, 1986."
    ]
}