{
    "creditos": 4,
    "codigo": "GLA104",
    "ementa": "Língua, linguagem e sociedade. Leitura e produção de textos. Mecanismos de textualização e de argumentação dos gêneros acadêmicos: resumo, resenha, handout, seminário. Estrutura geral e função sociodiscursiva do artigo científico. Tópicos de revisão textual.",
    "horas": 60,
    "nome": "PRODUÇÃO TEXTUAL ACADÊMICA",
    "objetivo": "Desenvolver a competência textual-discursiva de modo a fomentar a habilidade de leitura e produção de textos orais e escritos na esfera acadêmica.",
    "referencias_basicas": [
        "ANTUNES, I. Análise de Textos: fundamentos e práticas. São Paulo: Parábola, 2010.",
        "CITELLI, Adilson. O texto argumentativo. São Paulo: Scipione, 1994.",
        "MACHADO, Anna R.; LOUSADA, Eliane; ABREU-TARDELLI, Lilia S. Resenha. São Paulo: Parábola Editorial, 2004.",
        "MARCUSCHI, L. A. Produção textual, análise de gêneros e compreensão. São Paulo: Parábola Editorial, 2008.",
        "MEDEIROS, João B. Redação científica. São Paulo: Atlas, 2009.",
        "MOTTA-ROTH, D.; HENDGES, G. H. Produção textual na universidade. São Paulo: Parábola Editorial, 2010.",
        "SILVEIRA MARTINS, Dileta; ZILBERKNOP, Lúbia S. Português Instrumental: de acordo com as atuais normas da ABNT. 27. ed. São Paulo: Atlas, 2010."
    ],
    "referencias_complementares": [
        "ASSOCIAÇÃO BRASILEIRA DE NORMAS TÉCNICAS. NRB 6028: Informação e documentação - Resumos - Apresentação. Rio de Janeiro: ABNT, 2003.",
        "______. NRB 6023: Informação e documentação – Referências – Elaboração. Rio de Janeiro: ABNT, 2002.",
        "______. NRB 10520: Informação e documentação – Citações – Apresentação. Rio de Janeiro: ABNT, 2002.",
        "BLIKSTEIN, Izidoro. Técnicas de comunicação escrita. São Paulo: Ática, 2005.",
        "COSTA VAL, Maria da Graça. Redação e textualidade. São Paulo: Martins Fontes, 2006.",
        "COSTE, D. (Org.). O texto: leitura e escrita. Campinas: Pontes, 2002.",
        "FARACO, Carlos A.; TEZZA, Cristovão. Oficina de texto. Petrópolis: Vozes, 2003.",
        "GARCEZ, Lucília. Técnica de redação: o que é preciso saber para bem escrever. São Paulo: Martins Fontes, 2008.",
        "KOCH, Ingedore V. O texto e a construção dos sentidos. São Paulo: Contexto, 1997.",
        "______. Desvendando os segredos do texto. São Paulo: Cortez, 2009.",
        "______, I. V.; ELIAS, V. M. Ler e escrever: estratégias de produção textual. São Paulo: Contexto, 2009.",
        "MOYSÉS, Carlos A. Língua Portuguesa: atividades de leitura e produção de texto. São Paulo: Saraiva, 2009.",
        "PLATÃO, Francisco; FIORIN, José L. Lições de texto: leitura e redação. São Paulo: Ática, 2006.",
        "SOUZA, Luiz M.; CARVALHO, Sérgio. Compreensão e produção de textos. Petrópolis: Vozes, 2002."
    ]
}