{
    "codigo": "GCH012",
    "creditos": 4,
    "ementa": "Elementos de antropologia. Noções de epistemologia, ética e estética. Materialismo eIdealismo. As críticas da modernidade. Tópicos de filosofia contemporânea.",
    "horas": 60,
    "nome": "FUNDAMENTOS DA CRÍTICA SOCIAL",
    "objetivo": "Fomentar, através do contato com os principais marcos teóricos da Filosofia Moderna eContemporânea, a reflexão sobre os alicerces de toda ciência social.",
    "referencias_basicas": [
        "ADORNO, Theodor W.; HORKHEIMER, Max. Dialética do esclarecimento: fragmentosfilosóficos. Rio de Janeiro: Jorge Zahar, 1985.",
        "FREUD, Sigmund. O mal-estar na civilização. Rio de Janeiro: Imago, 2002.",
        "MARX, Karl; ENGELS, Friedrich. A ideologia alemã. São Paulo: Boitempo, 2007.",
        "NIETZSCHE, Friedrich. O nascimento da tragédia ou helenismo e pessimismo. SãoPaulo: Companhia das Letras, 2000.",
        "VAZ, Henrique C. Lima. Antropologia filosófica I. São Paulo: Loyola, 1991.",
        "VAZQUEZ, Adolfo Sanchez. Ética. São Paulo: Civilização brasileira, 2005."
    ],
    "referencias_complementares": [
        "CANCLINI, Nestor García. Culturas híbridas. São Paulo: Editora da USP, 2000.",
        "FAUSTO, Ruy. Marx: lógica e política, investigações para uma reconstituição do sentido dadialética. São Paulo: Brasiliense, 1983. (Tomo I).",
        "GRANGER, Giles-Gaston. A ciência e as ciências. São Paulo: ed. Unesp, 1994.",
        "HOBSBAWM, Eric. Era dos extremos: o breve século XX: 1914-1991. São Paulo:Companhia das Letras, 1995.",
        "HORKHEIMER, MAX. Eclipse da razão. São Paulo: Centauro, 2002.",
        "JAMESON, Frederic. Pós-modernismo: a lógica cultural do capitalismo tardio. 2. ed. SãoPaulo: Autores Associados, 2007.",
        "NOBRE, M. (Org.). Curso Livre de Teoria Crítica. 1. ed. Campinas: Papirus, 2008.",
        "REALE, Giovanni; ANTISERI, Dario. História da filosofia. 7. ed. São Paulo: Paulus, 2002.3 v.",
        "SARTRE, Jean-Paul. Marxismo e existencialismo. In: . Questão de método. SãoPaulo: Difusão Européia do Livro, 1972.",
        "SCHILLER, Friedrich. Sobre a educação estética. São Paulo: Herder, 1963.",
        "SILVA, Márcio Bolda. Rosto e alteridade: para um critério ético em perspectiva latinoamericana.São Paulo: Paulus, 1995."
    ]
}