{
    "codigo": "GCH008",
    "creditos": 4,
    "ementa": "O contexto da Universidade: Ensino, Pesquisa e Extensão. Epistemologia da Ciência.Instrumentos, métodos científicos e normas técnicas. Projeto, execução e publicação dapesquisa. A esfera político-acadêmica: instituições de fomento à pesquisa. Ética na pesquisacientífica, propriedade intelectual e autoria. Associações de pesquisa e eventos científicos.",
    "horas": 60,
    "nome": "INICIAÇÃO À PRÁTICA CIENTÍFICA",
    "objetivo": "Proporcionar reflexões sobre as relações existentes entre universidade, sociedade econhecimento científico e fornecer instrumentos para iniciar o acadêmico na prática daatividade científica.",
    "referencias_basicas": [
        "ADORNO. T. Educação após Auschwitz. In: ______. Educação e emancipação.São Paulo\/Rio de Janeiro: Paz e Terra, 1995.",
        "ALVES, R. Filosofia da Ciência: introdução ao jogo e as suas regras. 4. ed. São Paulo:Loyola, 2002.",
        "CHAUI, M. Escritos sobre a Universidade. São Paulo: Ed. UNESP, 2001.HENRY, J. A Revolução Científica: origens da ciência moderna. Rio de Janeiro: Zahar,1998.",
        "JAPIASSU, Hilton F. Epistemologia. O mito da neutralidade científica. Rio de Janeiro:Imago, 1975. (Série Logoteca).",
        "MARCONI, M. de A.; LAKATOS, E. M. Fundamentos de Metodologia Científica. 6. ed.São Paulo: Atlas, 2005.",
        "SEVERINO, A. J. Metodologia do trabalho científico. 23. ed. São Paulo: Cortez, 2007."
    ],
    "referencias_complementares": [
        "APPOLINÁRIO. Metodologia da ciência: filosofia e prática da pesquisa. São Paulo:Pioneira Thomson, 2006.",
        "D’ACAMPORA, A. J. Investigação científica. Blumenau: Nova Letra, 2006.",
        "GALLIANO, A. G. O Método Científico: teoria e prática. São Paulo: HARBRA, 1986.",
        "GIACOIA JR., O. Hans Jonas. O princípio responsabilidade. In: OLIVEIRA, M. A.Correntes fundamentais da ética contemporânea. Petrópolis: Vozes, 2000. p. 193-206.",
        "GIL, A. C. Métodos e Técnicas de Pesquisa Social. 5. ed. São Paulo: Atlas, 1999.",
        "GONSALVES, E. P. Iniciação à Pesquisa Científica. Campinas: Alínea, 2001.",
        "MORIN, E. Ciência com Consciência. Lisboa, Mem-Martins: Publicações Europa-América, 1994.",
        "OMMÈS, R. Filosofia da ciência contemporânea. São Paulo: Unesp, 1996.",
        "REY, L. Planejar e Redigir Trabalhos Científicos. 4. ed. São Paulo: Edgard Blücher,2003.",
        "SANTOS, A. R. dos. Metodologia científica: a construção do conhecimento. 6. ed. Rio deJaneiro: DP&A, 2004.",
        "SILVER, Brian L. A escalada da ciência. 2. ed. Florianópolis: Ed. da UFSC, 2008."
    ]
}