{
    "codigo": "GCH011",
    "creditos": 4,
    "ementa": "Cultura e processos sociais: senso comum e desnaturalização. As origens da Sociologia e oPositivismo. Os clássicos da Sociologia: Karl Marx, Émile Durkheim e Max Weber. Temascontemporâneos.",
    "horas": 60,
    "nome": "INTRODUÇÃO AO PENSAMENTO SOCIAL",
    "objetivo": "Proporcionar aos estudantes os instrumentos conceituais e metodológicos que lhespermitam analisar científica e criticamente os fenômenos sociais, políticos e culturais.",
    "referencias_basicas": [
        "DURKHEIM, Émile. Sociologia. José Albertino Rodrigues (Org.). São Paulo: EditoraÁtica, 1999.",
        "LALLEMENT, Michel. História das ideias sociológicas: das origens a Max Weber.Petrópolis: Vozes, 2005.",
        "LEVINE, Donald N. Visões da tradição sociológica. Rio de Janeiro: Jorge Zahar, 1997.",
        "MARTINS, Carlos Benedito. O que é sociologia. São Paulo: Brasiliense, 1994.",
        "IANNI, Octávio (Org.). Karl Marx: Sociologia. São Paulo: Ática, 1982. (Coleção GrandesCientistas Sociais).",
        "COHN, Gabriel (Org.). Max Weber: Sociologia. Tradução de Amélia Cohn e GabrielCohn. 2. ed. São Paulo: Atica, 1982."
    ],
    "referencias_complementares": [
        "COMTE, Augusto. Comte. 3. ed. São Paulo: Ática, 1989. (Coleção Grandes CientistasSociais).",
        "CORCUFF, Philippe. As novas sociologias: construções da realidade social. Bauru:EDUSC, 2010.",
        "DURKHEIM, Emile. As regras do método sociológico. São Paulo: Martins Fontes, 2007.",
        "GEERTZ, Clifford. A interpretação das culturas. Rio de Janeiro: LTC, 2008.",
        "GIDDENS, Anthony. Sociologia. Porto Alegre: Artmed, 2005.",
        "MARX, Karl. Contribuição à crítica da economia política. São Paulo: Martins Fontes,2003.",
        "OUTHWAITE, William; BOTTOMORE, Tom (Org.). Dicionário do pensamento socialdo século XX. Rio de Janeiro: Zahar, 1996.",
        "SELL, Carlos. Introdução à sociologia política. Petrópolis: Vozes, 2006.",
        "MORARES FILHO, Evaristo de (Org.). Georg Simmel: sociologia. São Paulo: Ática,1983.",
        "WEBER, MAX. Ensaios de Sociologia. Rio de Janeiro: Zahar, 1979."
    ]        
}