{
    "codigo": "GCH029",
    "creditos": 4,
    "ementa": "Estudo da história da Região Sul do Brasil com ênfase nos diferentes aspectos que abrangema dinâmica de desenvolvimento dos três estados. Questões fronteiriças. Processos depovoamento, despovoamento e colonização. Construções socioculturais.",
    "horas": 60,
    "nome": "HISTÓRIA DA FRONTEIRA SUL",
    "objetivo": "Compreender o processo de formação da Região Sul do Brasil por meio da análise deaspectos históricos do contexto de povoamento, despovoamento e colonização.",
    "referencias_basicas": [
        "AXT, Gunter. As guerras dos gaúchos: história dos conflitos do Rio Grande do Sul. PortoAlegre: Nova Prova, 2008.",
        "BOEIRA, Nelson; GOLIN, Tau. História Geral do Rio Grande do Sul. Passo Fundo:Méritos, 2006. 6 v.",
        "CEOM. Para uma história do Oeste Catarinense. 10 anos de CEOM. Chapecó: UNOESC,1995.",
        "MACHADO, Paulo Pinheiro. Lideranças do Contestado: a formação e a atuação das chefiascaboclas (1912-1916). Campinas: UNICAMP, 2004.",
        "RENK, Arlene. A luta da erva: um ofício étnico da nação brasileira no oeste catarinense.Chapecó: Grifos, 1997.",
        "WACHOWICZ, Ruy Christovam. História do Paraná. Curitiba: Gráfica Vicentina, 1988."
    ],
    "referencias_complementares": [
        "ALEGRO, Regina Celia et al. (Org.). Temas e questões: para o ensino de história do Paraná.Londrina: EDUEL, 2008.",
        "BRANCHER, Ana (Org.). História de Santa Catarina: estudos contemporâneos.Florianópolis: Letras Contemporâneas, 1999.",
        "CABRAL, Oswaldo Rodrigues. História de Santa Catarina. Florianópolis\/Rio de Janeiro:Sec\/Laudes, 1970.",
        "GOMES, Iria Zanoni. 1957, a revolta dos posseiros. Curitiba: Edições Criar, 1987.",
        "HEINSFELD, Adelar. A questão de Palmas entre Brasil e Argentina e o início dacolonização alemã no baixo vale do Rio do Peixe\/SC. Joaçaba: Edições UNOESC, 1996.",
        "LINO, Jaisson Teixeira. Arqueologia guarani no vale do Rio Araranguá, Santa Catarina:aspectos de territorialidade e variabilidade funcional. Erechim: Habilis, 2009.",
        "MOTA, Lucio Tadeu. As guerras dos índios Kaingang: a história épica dos índiosKanigang no Paraná (1769-1924). Maringá: EDUEM, 1994.",
        "RADIN, JoséCarlos. Representações da colonização. Chapecó: Argos, 2009.",
        "SANTOS, Sílvio Coelho dos. Índios e brancos no Sul do Brasil. Florianópolis: Lunardelli,1973.",
        "VALENTINI, Delmir José. Atividades da Brazil Railway Company no sul do Brasil: ainstalação da Lumber e a guerra na região do contestado: 1906-1916. Porto Alegre: PUC\/RS,2009. Originalmente apresentadocomo tese de doutorado."
    ]
}