{
    "codigo": "GCS011",
    "creditos": 4,
    "ementa": "Modos de produção e consumo. Noções de economia política. Relação entre ambiente esociedade: agroecologia, sustentabilidade, agricultura familiar, cooperativismo,associativismo. Sociedade civil e a questão ambiental.",
    "horas": 60,
    "nome": "MEIO AMBIENTE, ECONOMIA E SOCIEDADE",
    "objetivo": "Proporcionar aos acadêmicos a compreensão acerca dos principais conceitos que envolvema Economia Política e a sustentabilidade do desenvolvimento das relações socioeconômicase do meio ambiente.",
    "referencias_basicas": [
        "ALIER, Jean Martinez. Da economia ecológica ao ecologismo popular. Blumenau:Edifurb, 2008.",
        "BECKER, B.; MIRANDA, M. (Org.). A geografia política do desenvolvimentosustentável. Rio de Janeiro: Editora UFRJ, 1997.",
        "FERREIRA, L. C.; VIOLA, E. (Org.). Incertezas de sustentabilidade na globalização.Campinas: Editora da UNICAMP, 1996.",
        "LEFF, Enrique. Epistemologia ambiental. 2. ed. São Paulo: Cortez, 2002.",
        "MARX, Karl. O capital: crítica da economia política. 14. ed. Rio de Janeiro: BertrandBrasil, 1994.",
        "SMITH, Adam. Riqueza das nações: Uma investigação sobre a natureza e causas dariqueza das nações. Curitiba: Hermes, 2001."
    ],
    "referencias_complementares": [
        "CAVALCANTI, C. (Org.). Sociedade e natureza: estudos para uma sociedade sustentável.São Paulo: Cortez; Recife: Fundação Joaquim Nabuco, 1998.",
        "CHESNAIS, François. A mundialização do Capital. São Paulo: Xamã, 1996.",
        "FOSTER, John Bellamy. A Ecologia de Marx, materialismo e natureza. Rio de Janeiro:Civilização Brasileira, 2005.",
        "FURTADO, Celso. A economia latino-americana. São Paulo: Companhia das Letras,2007.",
        "GREMAUD, Amaury; VASCONCELLOS, Marco Antonio; JÚNIOR TONETO, Rudinei.Economia brasileira contemporânea. 4. ed. São Paulo: Editora Atlas, 2002.",
        "HUNT, E. K. História do pensamento econômico: uma perspectiva crítica. 2. ed. Rio deJaneiro: Elsevier, 2005.LÖWY, Michael. Eco-socialismo e planificação democrática. Crítica Marxista. n. 29,2009.",
        "NAPOLEONI, Claúdio. Smith, Ricardo e Marx. Rio de Janeiro. 4. ed. Rio de Janeiro:Graal, 1978.",
        "SEN, Amartia. Desenvolvimento como Liberdade. São Paulo: Companhia das Letras,2000.",
        "TREVISOL, Joviles Vitório. A educação ambiental em uma sociedade de risco: tarefas edesafios na construção da sustentabilidade. Joaçaba: Edições Unoesc, 2003."
    ]
}