{
    "codigo": "GCS318",
    "creditos": 4,
    "ementa": "Ética pessoal, profissional e pública na área da informática. Dilemas éticos do profissionalda informática: privacidade, vírus, hacking, uso da internet, direitos autorais, etc. Desempregoe informatização. Responsabilidade social. O profissional e o mercado de trabalho. Trabalhoe relações humanas. O empreendedorismo como opção do profissional da informática.Legislação: política nacional e tendências atuais referentes à regulamentação da profissão.",
    "horas": 60,
    "nome": "INFORMÁTICA E SOCIEDADE",
    "objetivo": "Desenvolver a consciência crítica com respeito à formação tecnológica e a atuação social,além de refletir criticamente sobre a ética, o uso da tecnologia e a atuação profissional",
    "referencias_basicas": [
        "GANDELMAN, H. De Gutemberg a Internet. São Paulo: Record, 2007.",
        "LEMOS, André. Cibercultura, tecnologia e vida social na cultura contemporânea. PortoAlegre: Sulina, 2002.",
        "MASIERO, P. C. Ética em Computação. Editora da Universidade de São Paulo, 2000.",
        "CHAVES, Antonio. Direitos Autorais na Computação de Dados. Rio de Janeiro: LTC,1996.",
        "PAESANI, Liliana M. Direito de Informática: Comercialização e Desenvolvimento Internacionaldo Software. São Paulo: Atlas, 1997."
    ],
    "referencias_complementares": [
        "VALLS, A. L. M. O que é ética. 9. ed. São Paulo: Brasiliense, 1994.BRASIL. Lei 7232\/22.10.84 -Política Nacional de Informática (Alterada por 8028\/90,8248\/92, 8402\/92, 2123\/01, 9959\/00, 10176\/01, 10664\/03). PITCE – Política Industrial, Tecnológicae de Comércio Exterior (2004-2007).RUBEN, G. Informática, Organizações e Sociedade no Brasil. São Paulo: CORTEZ,2003",
        "ROVER, A. J. Direito, Sociedade e Informática. Rio de Janeiro: FUNDAÇAO BOITEUX,2000."
    ]
}