{
    "codigo": "GEX090",
    "creditos": 4,
    "ementa": "Conceitos de banco de dados. Sistemas Gerenciadores de Banco de Dados (SGBDs). Modelosde dados. Modelagem conceitual e projeto de banco de dados. Modelo relacional: conceitos,restrições, linguagens de consulta, normalização. Controle de acesso.",
    "horas": 60,
    "nome": "BANCO DE DADOS I",
    "objetivo": "Entender o funcionamento de banco de dados. Conhecer os modelos de dados. Projetar ban-co de dados relacional e manipular os dados armazenados.",
    "referencias_basicas": [
        "SILBERSCHATZ, Abraham; KORTH, Henry F.; SUDARSHAN, S. Sistema de banco dedados. Rio de Janeiro: Elsevier, 2006.",
        "ELMASRI, Ramez; NAVATHE, Shamkant B. Sistemas de banco de dados. 4. ed. SãoPaulo: Pearson Addison Wesley, 2005.",
        "RAMAKRISHNAN, Raghu; GEHRKE, Johannes. Sistemas de gerenciamento de bancode dados. 3. ed. São Paulo: McGraw-Hill Medical, 2008.",
        "HEUSER, Carlos Alberto. Projeto de Banco de Dados. 6. ed. Porto Alegre: Bookman,2009. (Série Livros Didáticos – Instituto de Informática da UFRGS, n. 4)."
    ],
    "referencias_complementares": [
        "DATE, C. J. Introdução a Sistemas de Bancos de Dados. 8. ed. Rio de Janeiro: Campus,2004.",
        "ULLMAN, Jeffrey D.; WIDOM, Jennifer. A first course in database systems. 3. ed. PrenticeHall, 2008.GARCIA-MOLINA, Hector; ULLMAN, Jeffrey D.; WIDOM, Jennifer. Implementação desistemas de banco de dados. Rio de Janeiro: Campus, 2001.",
        "ULLMAN, Jeffrey D. Principles of database and knowledge-base systems. Rockville-MD: Computer Science Press, 1988-1989. 2 v.BATINI, C.; CERI, S.; NAVATHE, S. B. Conceptual Database Design: An Entity RelationshipApproach. Benjamin Cummings, 1992.",
        "TEOREY, Toby; LIGHTSTONE, Sam; NADEAU, Tom. Projeto e Modelagem de Bancosde Dados. São Paulo: Editora Campus, 2006.",
        "MACHADO, Felipe Nery Rodrigues; ABREU, Maurício Pereira de. Projeto de banco dedados: uma visão prática. 15. ed. São Paulo: Érica, 2008.",
        "ROFF, James R.; WEINBERG, Paul N. SQL: the complete reference. McGraw-Hill, 2002.",
        "ATZENI, Paolo; CERI, Stefano; PARABOSCHI, Stefano; TORLONE, Riccardo. DatabaseSystems Concepts, Languages and Architetures. McGraw-Hill, 1999."
    ]
}