{
    "codigo": "GEX001",
    "creditos": 4,
    "ementa": "Noções de lógica. Noções de conjuntos. Relações. Funções. Trigonometria. Matrizes eSistemas Lineares. Noções de Matemática Financeira. Sistemas de medidas. Geometria Planae Espacial.",
    "horas": 60,
    "nome": "MATEMÁTICA INSTRUMENTAL",
    "objetivo": "Utilizar conceitos e procedimentos em situações-problema para analisar dados, elaborar modelos,resolver problemas e interpretar suas soluções; sintetizar, criticar, deduzir, construir hipóteses,estabelecer relações e comparações, detectar contradições, decidir, organizar, expressar-se e argumentar com clareza, coerência e coesão.",
    "referencias_basicas": [
        "BATSCHELET, E. Introdução à Matemática para Biocientistas. São Paulo: Interciência eEDUSP, 1978.",
        "IEZZI, G.; MURAKAMI, C. et al. Fundamentos de matemática elementar. 7. ed. SãoPaulo: Atual, 1999. 11 v.LEITHOLD, L. O. Cálculo com Geometria Analítica. São Paulo: Editora HARBRA, 1994.v. 1.LIMA, Elon Lages; CARVALHO, P. C. P.; WAGNER, E. et al. A matemática do ensinomédio. 5. ed. Rio de Janeiro: SBM. 2001. 3 v."
    ],
    "referencias_complementares": [
        "BASSANEZI, R. C. Ensino-aprendizagem com modelagem matemática. São Paulo:Contexto, 2004.",
        "CARVALHO, Paulo César Pinto. Introdução à geometria espacial. Rio de Janeiro: SBM,1993.",
        "EVES, H. Introdução à história da matemática. 3. ed. Campinas: Unicamp, 2002.",
        "HEFEZ, Abramo. Elementos de Aritmética. Textos Universitários. Rio de Janeiro: IMPA,2005.",
        "LIMA, Elon Lages. Medida e forma em geometria. Rio de Janeiro: SBM, 2009.",
        "MILIES, Francisco César Polcino; COELHO, Sônia Pitta. Números: uma introdução àmatemática. São Paulo: EDUSP, 2003.",
        "MOREIRA, Plínio; DAVID, Maria Manuela. A formação matemática do professor,licenciatura e prática docente escolar. Belo Horizonte: Autêntica, 2005.NEWTON-SMITH, W. H. Lógica: um curso introdutório. Lisboa: Editora Gradiva, 1998.",
        "SCHLIEMANN, Ana Lúcia; CARRAHER, David. Na vida dez, na escola zero. 10. ed. SãoPaulo: Cortez editora, 1995.SÉRATES, J. Raciocínio lógico: lógico matemático, lógico quantitativo, lógico numérico,lógico analítico, lógico crítico. 5. ed. Brasília: Gráfica e Editora Olímpica Ltda, 1997.",
        "WAGNER, Eduardo. Construções geométricas. Rio de Janeiro: SBM, 2001."
    ]
}