{
    "codigo": "GEX098",
    "creditos": 4,
    "ementa": "Conceitos de programação orientada a objetos. Classes. Herança. Encapsulamento. Polimorfismo.Associações. Reusabilidade de software. Componentes. Criação e uso de bibliotecasde classes. Interface gráfica com o usuário. Persistência de dados e de objetos. Tratamentode exceções e erros. Aspectos de projeto orientado a objetos. Prática de programação usandouma linguagem de programação orientada a objetos.",
    "horas": 60,
    "nome": "PROGRAMAÇÃO I",
    "objetivo": "Compreender os conceitos fundamentais do paradigma de programação orientada a objetose aplicá-los no desenvolvimento de soluções de software.",
    "referencias_basicas": [
        "SANTOS, Rafael. Introdução à programação orientada a objetos usando Java. 8.reimp. Rio de Janeiro: Elsevier, 2003.",
        "DEITEL, Harvey M.; DEITEL, Paul J. Java Como Programar. 8. ed. São Paulo: Pearson,2010.",
        "BORATTI, Isaias Camilo. Programação orientada a objetos em JAVA. Florianópolis:Visual Books, 2007.GONÇALVES, Edson. Desenvolvendo Aplicações Web com JSP, Servlets, Java ServerFaces, Hibernate, EJB 3 Persistence e Ajax. 1. ed. Rio de Janeiro: Ciência Moderna,2007.",
        "CORNELL, G.; HORSTMANN, C. S. Core Java – Fundamentos. São Paulo: Prentice HallBrasil, 2009. v. 1."
    ],
    "referencias_complementares": [
        "ECKEL, Bruce. Thinking in Java. Prentice-Hall, 2000.",
        "LEWIS, J.; LOFTUS, W. Java Software Solutions -Foundations of Program Design. Addison-Wesley, 1999.",
        "KEOGH, Jim; GRANNINI, Mario. OOP Desmistificado – Programação Orientada a Objetos.Rio de Janeiro: Alta Books, 2005.",
        "HEMRAJANI, Anil. Desenvolvimento Ágil em Java com Spring, Hibernate e Eclipse. 1.ed. São Paulo: Pearson, 2007.",
        "LARMAN, C. Utilizando UML e Padrões: uma Introduçao à Análise e ao Projeto Orientadosa Objetos. 3. ed. São Paulo: Bokkman Companhia, 2007.",
        "CARDOSO, C. Orientação a Objetos na Prática. Rio de Janeiro: Ciência Moderna, 2006."
    ]
}