{
    "codigo": "GEX002",
    "creditos": 4,
    "ementa": "Fundamentos de informática. Conhecimentos de sistemas operacionais. Utilização da redemundial de computadores. Acesso a ambientes virtuais de aprendizagem. Conhecimentosde editor de texto, planilha eletrônica e software de apresentação (textos, gráficos, tabelas,áudios, vídeos e imagens).",
    "horas": 60,
    "nome": "INTRODUÇÃO À INFORMÁTICA",
    "objetivo": "Operar as ferramentas básicas de informática de forma a poder utilizá-lasinterdisciplinarmente, de modo crítico, criativo e pró-ativo.",
    "referencias_basicas": [
        "CAPRON, H. L; JOHNSON, J. A. Introdução à Informática. 8. ed. São Paulo: PearsonPrentice Hall, 2004.",
        "NORTON, P. Introdução à Informática. 1. ed. Rio de Janeiro: Makron Books, 1997.",
        "VELLOSO, Fernando de C. Informática: conceitos básicos. 7. ed. Rio de Janeiro: Campus,2004.",
        "ANTONIO, João. Informática para Concursos: teoria e questões. Rio de Janeiro:Campus-Elsevier, 2009."
    ],
    "referencias_complementares": [
        "FEDELI, Ricardo D.; POLLONI, Enrico G. P.; PERES, Fernando E. Introdução à ciênciada computação. 2. ed. São Paulo: CENGAGE Learning, 2010.",
        "HILL, Benjamin Mako; BACON, Jono. O livro oficial do Ubuntu. 2. ed. Porto Alegre:Bookman, 2008.",
        "LANCHARRO, Eduardo Alcalde; LOPEZ, Miguel Garcia; FERNANDEZ, SalvadorPeñuelas. Informática básica. São Paulo: Pearson Makron Books, 2004.",
        "MANZANO, André Luiz N. G.; TAKA, Carlos Eduardo M. Estudo dirigido de MicrosoftWindows 7 Ultimate. São Paulo: Érica, 2010.",
        "MANZANO, A. L. N. G.; MANZANO, M. I. N. G. Estudo dirigido de informáticabásica. 7. ed. rev. atual. e ampl. São Paulo: Érica, 2007.",
        "MEYER, M.; BABER, R.; PFAFFENBERGER, B. Nosso futuro e o computador. PortoAlegre: Bookman, 1999.",
        "MONTEIRO, M. A. Introdução à organização de computadores. 5. ed. Rio de Janeiro:LTC, 2007.",
        "OLIVEIRA, Ramon de. Informática educativa. 12. ed. Campinas: Papirus, 2007.",
        "SCHECHTER, Renato. BROffice Calc e Writer: trabalhe com planilhas e textos emsoftware livre. Rio de Janeiro: Elsevier, 2003."
    ]
}