{
    "codigo": "GEX012",
    "creditos": 2,
    "ementa": "Álgebra Linear em espaços euclidianos: espaços vetoriais euclidianos. Produto interno.Transformações lineares. Autovalores e autovetores. Diagonalização.",
    "horas": 30,
    "nome": "ÁLGEBRA LINEAR",
    "objetivo": "Propiciar ao aluno condições de identificar e abstrair propriedades fundamentais que definemum espaço vetorial real; identificar e reconhecer a matriz de uma transformações linear;explicitar e reconhecer como subespaços vetoriais o núcleo e a imagem de uma transformaçãolinear; identificar operadores lineares; calcular autovalores e autovetores de umatransformação linear; aplicar autovalores e autovetores a diversos problemas que se apresentem.",
    "referencias_basicas": [
        "CALLIOLI, C.; DOMINGUES, H.; COSTA, R. Álgebra linear e aplicações. 6. ed. SãoPaulo: Atual, 2006.",
        "SANTOS, R. J. Um curso de geometria analítica e álgebra linear. Belo Horizonte: ImprensaUniversitária, 2009.",
        "ANTON, H.; RORRES, C. Álgebra linear com aplicações. São Paulo: Bookman, 2001.",
        "LEON, S. J. Álgebra linear com aplicações. 4. ed. Rio de Janeiro: LTC, 1999."
    ],
    "referencias_complementares": [
        "BOLDRINI, J. L.; COSTA, S. I. R.; FIGUEIREDO, V. L.; WETZLER, H. G. Álgebra linear.3. ed. São Paulo: Harbra, 1986.",
        "STEINBRUCH, A.; WINTERLE, P. Álgebra linear. 2. ed. São Paulo: Makron Books,1990.",
        "LIMA, E. L. Álgebra linear. 2. ed. Rio de Janeiro: IMPA, 2008.",
        "COELHO, F. U.; LOURENÇO, M. L. Um curso de álgebra linear. 2. ed. São Paulo:Edusp, 2001.",
        "HOFFMAN, K. M.; KUNZE, R. Linear algebra. 2. ed. Englewood Cliffs-NJ: PrenticeHall, 1971.",
        "LIPSCHUTZ, S.; LIPSON, M. Álgebra linear. 3. ed. São Paulo: Bookman, 2004."
    ]
}