{
    "codigo": "GEX033",
    "creditos": 4,
    "ementa": "Funções de várias variáveis. Limites e continuidade. Derivadas parciais e aplicações.Gradiente. Diferenciabilidade. Multiplicadores de Lagrange. Funções vetoriais. Divergentee rotacional. Integrais múltiplas. Integrais curvilíneas e de superfície. Aplicações daintegração. Teoremas de Green, Gauss e Stokes.",
    "horas": 60,
    "nome": "CÁLCULO II",
    "objetivo": "Introduzir as principais ferramentas do cálculo diferencial e integral de funções de váriasvariáveis e cálculo vetorial, abordando aplicações tanto de âmbito geral como relativo aocurso específico. Ademais, visa-se à estruturação e ao aprimoramento do raciocínio lógicodedutivoe à aquisição de conhecimentos técnicos importantes para os referidos cursos.",
    "referencias_basicas": [
        "FLEMMING, D. M.; GONÇALVES, M. B. Cálculo B\/C. 2.\/3. ed. São Paulo: MakronBooks, 2007.",
        "GUIDORIZZI, H. L. Um curso de cálculo. 5. ed. Rio de Janeiro: LTC, 2001. v. 2 e 3.LEITHOLD, L. O cálculo com geometria analítica. 3. ed. São Paulo: Harbra, 1994. v. 2.STEWART, J. Cálculo. 6. ed. São Paulo: Cengage Learning, 2010. v. 2."
    ],
    "referencias_complementares": [
        "ANTON, H.; BIVENS, I.; DAVIS, S. Cálculo. 8. ed. São Paulo: Bookman, 2007. v. 2.",
        "APOSTOL, T. M. Calculus. 2. ed. New York: John Willey & Sons, 1969. v. 2.",
        "LARSON, R.; HOSTETLER, R. P.; EDWARDS, B. H. Cálculo. 8. ed. São Paulo: McGrawHill, 2006. v. 2.",
        "SALAS, Saturnino L.; HILLE, Einar; ETGEN, Garret J. Cálculo. 9. ed. Rio de Janeiro:LTC, 2005. 542 p. v. 2.",
        "SIMMONS, G. F. Cálculo com geometria analítica. São Paulo: McGraw Hill, 1987. v. 2.",
        "THOMAS, G. B. Cálculo. 11. ed. São Paulo: Addison Wesley, 2008. v. 2."
    ]
}