{
    "codigo": "GEX112",
    "creditos": 4,
    "ementa": "Segurança em aplicações: programação segura, detecção de falhas, códigos maliciosos(malware). Segurança em sistemas operacionais: princípios de controle de acesso, sistemasconfiáveis. Segurança em redes de computadores: ataques e defesas. Princípios de criptografia:criptografia simétrica e assimétrica, integridade de dados. Protocolos de autenticação:princípios, infra-estrutura de chaves públicas e aplicações, e protocolos criptográficos.",
    "horas": 60,
    "nome": "SEGURANÇA E AUDITORIA DE SISTEMAS",
    "objetivo": "Reconhecer e relacionar os principais riscos envolvidos no ambiente de informações e osprincipais pontos de controle de auditoria da tecnologia da informação no que se refere à auditoriado desenvolvimento e manutenção de sistemas, administração de dados, administraçãode banco de dados, e administração de redes de computadores.",
    "referencias_basicas": [
        "SCHMIDT, Paulo; ARIMA, Carlos Hideo; SANTOS, José Luiz dos. Fundamentos de Auditoriade Sistemas. São Paulo: Atlas, 2006.",
        "ONOME, J. Auditoria de Sistemas de Informação. Rio de Janeiro: Editora Atlas, 2005.",
        "GREG, Hoglund; GARY, Macgraw. Como quebrar códigos – a arte de explorar e protegersoftware. São Paulo: Makron Books, 2006.",
        "GIL, A. Auditoria de Computadores.São Paulo: Atlas 2000."
    ],
    "referencias_complementares": [
        "MELLO, Sandro. Computação forense com software livre – conceitos, técnicas, ferramentase estudos de casos. São Paulo: Atlas, 2009.",
        "CARUSO, Carlos A. A.; STEFFEN, Flávio D. Segurança em Informática e de Informações.2. ed. São Paulo: Senac, 1999.",
        "GIL, A. L. Fraudes Informatizadas.São Paulo: Atlas, 1999.",
        "DIAS, C. Segurança e Auditoria da Tecnologia da Informação. Rio de Janeiro: EditoraAxcel Books, 2000.",
        "SCHMIDT, P. Fundamentos de Auditoria de Sistemas. São Paulo: Editora Atlas, 2006."
    ]
}