{
    "codigo": "GEX434",
    "creditos": 4,
    "ementa": "Definição de sistemas multimídia e problemática envolvida. Representação digital de áudio,imagens e vídeos. Técnicas e padrões de compressão. Aplicações multimídia: caracterizaçãoe requisitos. Protocolos de transporte de mídia e de controle-sinalização. Qualidade deServiço.",
    "horas": 60,
    "nome": "SISTEMAS MULTIMÍDIA",
    "objetivo": "Conhecer as áreas, tecnologias e metodologias de desenvolvimento de sistemas multimídia.",
    "referencias_basicas": [
        "VAUGHAN, T. Multimedia Making it Work. McGraw-Hill, 2001.",
        "ENGLAND, E.; FINNEY, A.; FINNEY, A. Managing Multimedia. Addison Wesley,1996.PAULA FILHO, W. de P. Multimídia: Conceitos e Aplicações. Rio de Janeiro: LTC Editora,2000.",
        "DAN, A.; SITARA, D. Multimedia Servers: Applications, Environments, and Design(Multimedia Information and Systems). Morgan Kaufmman, 1999.",
        "KUO, Franklin F. Multimedia Communications: Protocols & Applications. Prentice Hall,1997.",
        "HALSALL, F. Multimedia Communications: Applications, Networks, Protocols, andStandards. Addison-Wesley Publishing, 2000."
    ],
    "referencias_complementares": [
        "BUFORD, J. F. K. Multimedia Systems. Addison Wesley, 1994.",
        "STOLFI, G. Compressão de Imagens, JPEG, PEE647 – Princípios de Televisão Digital.2002.",
        "VELHO, L. Computação Gráfica e Processamento de Imagens. McGrawHill, 1996.",
        "KRISTOF, R.; SATRAN, A. Interactivity by Design: Creating & Communicating WithNew Media. Hayden Books, 1995.",
        "FLUCKIGER, F. Understanding Networked Multimedia: Applications and Technology.Prentice Hall, 1995.",
        "KUO, F.; EFFELSBERG, W.; GARCIA-LUNA-ACEVES, J. J. Multimedia Communications:Protocols and Applications. Prentice Hall PTR, 1998.",
        "AGNEW, P. W.; KELLERMAN, A. S. Distributed Multimedia: Technologies, Applications,and Opportunities in the Digital Information Industry. A Guide for Users and Providers.Addison Wesley, 1996.",
        "ROESLER, V. Perspectivas em Transmissão Multimídia e TV Digital. Instituto de Informática,Universidade Federal do Rio Grande do Sul (UFRGS), 2007."
    ]
}