{
    "codigo": "GEX438",
    "creditos": 4,
    "ementa": "Princípios, organização e métodos de administração de rede. Tecnologias para operação egerência de rede. Recursos humanos para administração de rede. Plataformas de gerência deredes. Aplicações de gerência de rede.",
    "horas": 60,
    "nome": "ADMINISTRAÇÃO E GERÊNCIA DE REDES",
    "objetivo": "Compreender assuntos relativos à teoria e prática da administração e gerência de redes decomputadores e telecomunicações, incluindo a definição e implementação de políticas administrativase a documentação de recursos, serviços, ações e procedimentos.",
    "referencias_basicas": [
        "LOPES, Raquel V.; SAUVÉ, Jacques P.; NICOLLETTI, Pedro S. Melhores Práticas paraGerência de Redes de Computadores. 1. ed. Campus, 2003. Disponível em: <http:\/\/www2.lsd.ufcg.edu.br\/~raquel\/livro\/livro-unico3.pdf>. Acesso em: 07\/04\/2010.",
        "MILLER, M. A. Managing Internetworks with SNMP. 3. ed. John Wiley Consumer,1999.",
        "STALLINGS, William. SNMP, SNMPv2, SNMPv3 e RMON 1 RMON 2. 3. ed. Addison-Wesley, 1999.",
        "COMER, Douglas E. Interligação de redes com TCP\/IP. 5. ed. Rio de Janeiro: Campus,2006. v. 1.KUROSE, James F.; ROSS, Keith W. Redes de computadores e a Internet: uma abordagemtop-down. 5. ed. São Paulo: Pearson Addison Wesley, 2010."
    ],
    "referencias_complementares": [
        "BLACK, U. Network Management Standards. Ed. McGrawHill, 1995.",
        "AIDAROUS, S.; PLEVYAK, T. Telecommunications Network Management Technologiesand Implementations. IEEE Press, 1998.",
        "GHETIE, I. G. Networks and Systems Management. Norwell-MA: Ed. Kluwer AcademicPublishers, 1997.Network Management Forum. A Technical Strategy: Implementing TMN using OMNI-Point. Morristown-NJ: Ed. NMF, 1994.",
        "ROSE, M. T.; McCLOGHRIE, K. How to Manage Your Network Using SNMP TheNetworking Management Practicum. Prentice-Hall, 1995."
    ]
}