{
    "codigo": "GEX439",
    "creditos": 4,
    "ementa": "Dispositivos e redes móveis. Mobilidade de código e agentes móveis. Computação nômadee computação móvel. Computação pervasiva e ubíqua. Arquitetura de software móvel.Computação ciente-de-contexto: adaptação dinâmica, middlewares de reconhecimento decontexto, linguagens de descrição de contexto. Comunicação com IP Móvel. Redes Ad HocMóveis: protocolos em redes ad hoc móveis. Sistemas Voláteis. Serviços de Descoberta deServiços. Segurança e Privacidade. Adaptação. Estudos de casos.",
    "horas": 60,
    "nome": "COMPUTAÇÃO MÓVEL",
    "objetivo": "Compreender e aplicar paradigmas e modelos da Computação Móvel.",
    "referencias_basicas": [
        "SCHILLER, J. Mobile Communications. Addison Wesley, 2000.",
        "COULOURIS, G. et al. Distributed Systems: Concepts and Design. 4. ed. Addison Wesley,2005.",
        "BIGUS, Joseph; BIGUS, Jennifer. Construcuting Intelligents Agents with Java. JohnWiley, 1998.",
        "WOOLDRIDGE, Michel. An Introduction to Multiagent Systems. John Wiley, 2002.",
        "ADELSTEIN, F. et al. Fundamentals of Mobile and Pervasive Computing. McGraw-Hill, 2005.",
        "PITOURA, Evaggelia; SAMARAS, George. Data Management for Mobile Computing.Kluwer Academic Publishers, 1998."
    ],
    "referencias_complementares": [
        "LANGE, Danny B.; OSHIMA, Mitsuru. Programming and Deploying Java MobileAgents with Aglets. Addison Wesley, 1998.",
        "BRENNER, Walter; ZARNEKOW, Rudiger; WITTIG, Harmut. Intelligent SoftwareAgents: Foundations and Applications. Springer, 1998.",
        "SCHILLER, J.; VOISARD, A. Location-Based Services. Elsevier, 2004.Artigos disponíveis em:<http:\/\/www.wirelessbrasil.org\/wirelessbr\/colaboradores\/a_corbioli\/ip_movel_01.html>.<http:\/\/www.gta.ufrj.br\/grad\/00_1\/bruno\/index.htm>.<http:\/\/www.dimap.ufrn.br\/~gold\/protocolos.html>.MATEUS, Geraldo Robson; LOUREIRO, Antonio Alfredo F. Introdução à ComputaçãoMóvel. 11. Escola de Computação, COPPE\/Sistemas, NCE\/UFRJ, 1998."
    ]
}