{
    "codigo": "GEX436",
    "creditos": 4,
    "ementa": "Modelos de sistemas digitais: unidade de controle e unidade de processamento. Modelo deum sistema de computação. Conceitos básicos de arquitetura: modo de endereçamento, tipode dado e conjunto de instruções. Chamada de subrotina; Linguagem Assembly. RISC vs.CISC. Pipeline. Organização de memória (uniprocessadores). Tratamento de interrupções eexceções. Entrada e saída.",
    "horas": 60,
    "nome": "ARQUITETURA DE COMPUTADORES",
    "objetivo": "Conhecer os conceitos envolvidos na concepção da arquitetura e organização dos computadores,entendendo o conjunto de instruções, sua forma de implementação em hardware esua programação",
    "referencias_basicas": [
        "STALLINGS, W. Arquitetura e Organização de Computadores. São Paulo: PrenticeHall, 2002.",
        "TANENBAUM, A. S. Organização Estruturada de Computadores. Ed. Prentice \/ Halldo Brasil, 1992.",
        "HENNESSY, J. L.; PATTERSON, D. A. Arquitetura de Computadores – Uma AbordagemQuantitativa. Rio de janeiro: Ed. Campus, 2003.",
        "MONTEIRO, Mario A. Introdução a Organização de Computadores. 3. ed. Rio de Janeiro:LTC, 1996.",
        "MURDOCCA, Miles J. Introdução a Arquitetura de Computadores. Rio de Janeiro:Campus, 2001.",
        "HENNESSY, John L. Organização e Projetos de Computadores: 2. ed. Rio de Janeiro:LTC, 2000."
    ],
    "referencias_complementares": [
        "ZUFFO, J. A. Fundamentos de Arquitetura e Organização de Microprocessadores. SãoPaulo: Edgard Blücher, 1978.",
        "MALVINO, A. Microcomputadores e Microprocessadores. Ed. McGraw-Hill do Brasil,1985.",
        "MELO, M. Eletrônica Digital. São Paulo: Makron Books, 1993.",
        "BUYYA, Rajkumar (Ed.). High Performance Cluster Computing: Programming and Applications.Prentice-Hall, 1999. 2 v.CASAVANT, Thomas L.; KUHL, Jon G. A Taxonomy of Scheduling in General-PurposeDistributed Computing Systems. IEEE Transactions on Software Engineering, v. 14, n.2, p. 141-154, Feb. 1988.",
        "IDOETA, Ivan Valeije. Elementos de Eletrônica Digital. 32. ed. São Paulo: Érica, 2001.",
        "TOCCI, Ronald J. Microprocessadores e Microcomputadores. 3. ed. Rio de Janeiro:Prentice Hall, 1987.",
        "TOCCI, Ronald J. Sistemas Digitais: Rio de Janeiro: Prentice Hall, 1991."
    ]
}