{
    "codigo": "GEX433",
    "creditos": 4,
    "ementa": "Modelagem de sistemas. Modelos analíticos e Modelos de simulação. Processos estocásticos.Introdução à teoria das filas. Redes de filas. Geração de números pseudo-aleatórios.Geração de variáveis aleatórias. Metodologia de projetos de modelagem e simulação de sistemas.Modelos voltados à simulação: definição, taxonomia e desenvolvimento. Validaçãode modelos de simulação. Praticas de modelagem e simulação. Linguagens de simulação.Estudo de casos.",
    "horas": 60,
    "nome": "MODELAGEM E SIMULAÇÃO",
    "objetivo": "Fornecer fundamentos teóricos e práticos para o desenvolvimento de mecanismos de suportea simulação de sistemas e de modelos de simulação como ferramenta de apoio à verificação,validação, construção de sistemas reais, de treinamento, entre outras aplicações",
    "referencias_basicas": [
        "FREITAS Filho, P. J. Introdução à Modelagem e Simulação de Sistemas com aplicaçõesem arena. São Paulo: Ed. Visual Books, 2008.",
        "CHWIF, Leonardo; MEDINA, Afonso C. Modelagem e Simulação de Eventos Discretos.2. ed. São Paulo: Ed. Dos Autores, 2007.",
        "FUJIMOTO, T. M. Parallel and distributed simulation. Ed. John Wiley, 2000.",
        "SOUZA, A. C. Z. de; PINHEIRO, C. A. M. Introdução a Modelagem, Análise e Simulaçãode Sistemas Dinâmicos. São Paulo: INTERCIENCIA, 2008."
    ],
    "referencias_complementares": [
        "PROFOZICH, David. Managing Changing with BPS. Prendice-Hall, 1997.KELTON et al. Simulation with Arena. McGraw-Hill, 1998.",
        "LAW, A. M.; KELTON, W. D. Simulation Modeling and Analisys. McGraw-Hill, 1991.",
        "BANKS, J.; CARSON, J. Discrete-Event System Simulation. Prendice-Hall, 1996."
    ]
}