{
    "codigo": "GLA004",
    "creditos": 4,
    "ementa": "Compreensão, produção e circulação de textos orais e escritos da esfera acadêmica eprofissional: seminário, resenha, artigo. Mecanismos de textualização e de argumentação dosgêneros acadêmicos e técnicos. Tópicos gramaticais. Revisão textual.",
    "horas": 60,
    "nome": "LEITURA E PRODUÇÃO TEXTUAL II",
    "objetivo": "Desenvolver a competência textual-discursiva de modo a fomentar a habilidade de leitura eprodução de textos orais e escritos nas esferas acadêmica e profissional.",
    "referencias_basicas": [
        "CITELLI, Adilson. O texto argumentativo. São Paulo: Scipione, 1994.",
        "ECO, Umberto. Como se faz uma tese. São Paulo: Perspectiva, 1989.",
        "MACHADO, Anna R.; LOUSADA, Eliane; ABREU-TARDELLI, Lilia S. Resenha. SãoPaulo: Parábola Editorial, 2004.",
        "MEDEIROS, João B. Redação científica. São Paulo: Atlas, 2009.MOTTA-ROTH, Desirré (Org.). Redação acadêmica: princípios básicos. Santa Maria:Imprensa Universitária, 2001.SILVEIRA MARTINS, Dileta; ZILBERKNOP, Lúbia S. Português Instrumental: de acordocom as atuais normas da ABNT. 27. ed. São Paulo: Atlas, 2010."
    ],
    "referencias_complementares": [
        "BLIKSTEIN, Izidoro. Técnicas de comunicação escrita. São Paulo: Ática, 2005.",
        "COSTE, D. (Org.). O texto: leitura e escrita. Campinas: Pontes, 2002.",
        "FARACO, Carlos A.; TEZZA, Cristovão. Oficina de texto. Petrópolis: Vozes, 2003.",
        "GARCEZ, Lucília. Técnica de redação: o que é preciso saber para bem escrever. São Paulo:Martins Fontes, 2008.",
        "KOCH, Ingedore V. O texto e a construção dos sentidos. São Paulo: Contexto, 1997.______. Desvendando os segredos do texto. São Paulo: Cortez, 2009.MOYSÉS, Carlos A. Língua Portuguesa: atividades de leitura e produção de texto. SãoPaulo: Saraiva, 2009.PLATÃO, Francisco; FIORIN, José L. Lições de texto: leitura e redação. São Paulo: Ática,2006.",
        "SOUZA, Luiz M.; CARVALHO, Sérgio. Compreensão e produção de textos. Petrópolis:Vozes, 2002.COSTA VAL, Maria da Graça. Redação e textualidade. São Paulo: Martins Fontes, 2006."
    ]
}