{
    "codigo": "GLA045",
    "creditos": 4,
    "ementa": "1. Visão contemporânea da inclusão e da educação especial na área da surdez. 2. Cultura eidentidade da pessoa surda. 3. Tecnologias voltadas para a surdez. 4. História da linguagemde movimentos e gestos. 4. Breve introdução aos aspectos clínicos, educacionais e sócioantropológicosda surdez. 5. Características básicas da fonologia de Libras: configuraçõesde mão, movimento, locação, orientação da mão, expressões não-manuais. 5. O alfabeto:expressões manuais e não manuais. 6. Sistematização e operacionalização do léxico. 7.Morfologia, sintaxe, semântica e pragmática da Libras; 8. Diálogo e conversação. 9.Didática para o ensino de Libras.",
    "horas": 60,
    "nome": "LÍNGUA BRASILEIRA DE SINAIS (Libras)",
    "objetivo": "Dominar a língua brasileira de sinais e elaborar estratégias para seu ensino, reconhecendo-acomo um sistema de representação essencial para o desenvolvimento do pensamento dapessoa surda.",
    "referencias_basicas": [
        "BRASIL. Língua Brasileira de Sinais. Brasília: SEESP\/MEC, 1998.",
        "BRITO, Lucinda Ferreira. Por uma gramática de línguas de sinais. Rio de Janeiro:Tempo Brasileiro, 1995.",
        "COUTINHO, Denise. LIBRAS e Língua Portuguesa: Semelhanças e diferenças. JoãoPessoa: Arpoador, 2000.",
        "FELIPE, Tanya; MONTEIRO, Myrna. LIBRAS em Contexto: Curso Básico: Livro doProfessor. 4. ed. Rio de Janeiro: LIBRAS Editora Gráfica, 2005.",
        "QUADROS, Ronice Muller de. Língua de sinais brasileira: estudos lingüísticos. PortoAlegre: Artmed, 2004.",
        "SACKS, Oliver W. Vendo Vozes: uma viagem ao mundo dos surdos. São Paulo:Companhia dasLetras, 1998."
    ],
    "referencias_complementares": [
        "BRASIL. Decreto 5.626\/05. Regulamenta a Lei n. 10.436, de 24 de abril de 2002, quedispõe sobre a Língua Brasileira de Sinais -Libras, e o art. 18 da Lei n. 10.098, de 19 dedezembro de 2000. Brasília, 2005.",
        "CAPOVILLA, Fernando César; RAPHAEL, Walkiria Duarte. Dicionário EnciclopédicoIlustrado Trilíngüe – LIBRAS. São Paulo: EDUSP \/ Imprensa Oficial, 2001.",
        "LABORIT,Emmauelle. O Vôo da Gaivota. Paris: Editora BestSeller, 1994.",
        "LODI,Ana Cláudia Balieiro etal. Letramento e Minorias. Porto Alegre: Mediação, 2002.",
        "MOURA, Maria Cecília de. O surdo: caminhos para uma nova identidade. Rio de Janeiro:Ed. Revinter, 2000.______. Língua de Sinais e Educação do Surdo. Série neuropsicológica. São Paulo: TECART, 1993. v. 3.PIMENTA, Nelson; QUADROS, Ronice Muller de. Curso de LIBRAS 1. 1. ed. Rio deJaneiro: LSB Vídeo, 2006.",
        "QUADROS, Ronice Muller. Educação de surdos. A Aquisição da Linguagem. PortoAlegre: Editora Artmed, 1997SACKS, Oliver. Vendo Vozes – Uma viagem ao mundo dos surdos. São Paulo: Cia. dasLetras, 1998."
    ]
}